<!doctype html>



  


<html class="theme-next mist use-motion" lang="en">
<head>
  <!-- hexo-inject:begin --><!-- hexo-inject:end --><meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>









<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />















  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="UML,Class," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.1.1" />






<meta name="description" content="&amp;#x6700;&amp;#x8FD1;&amp;#x5728;&amp;#x5B66;&amp;#x4E60;&amp;#x5982;&amp;#x4F55;&amp;#x7528;UML&amp;#x5BF9;&amp;#x7CFB;&amp;#x7EDF;&amp;#x8FDB;&amp;#x884C;&amp;#x5EFA;&amp;#x6A21;&amp;#xFF0C;&amp;#x5176;&amp;#x5B9E;&amp;#x4E24;&amp;#x4E09;&amp;#x5E74;&amp;#x524D;&amp;#x5C31;&amp;#x8BD5;&amp;#x">
<meta name="keywords" content="UML,Class">
<meta property="og:type" content="article">
<meta property="og:title" content="类的理解与总结">
<meta property="og:url" content="jack2gs.github.io/2017/12/17/class-note/index.html">
<meta property="og:site_name" content="Jack Gao&#39;s Blog">
<meta property="og:description" content="&amp;#x6700;&amp;#x8FD1;&amp;#x5728;&amp;#x5B66;&amp;#x4E60;&amp;#x5982;&amp;#x4F55;&amp;#x7528;UML&amp;#x5BF9;&amp;#x7CFB;&amp;#x7EDF;&amp;#x8FDB;&amp;#x884C;&amp;#x5EFA;&amp;#x6A21;&amp;#xFF0C;&amp;#x5176;&amp;#x5B9E;&amp;#x4E24;&amp;#x4E09;&amp;#x5E74;&amp;#x524D;&amp;#x5C31;&amp;#x8BD5;&amp;#x">
<meta property="og:updated_time" content="2018-03-16T16:13:04.645Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="类的理解与总结">
<meta name="twitter:description" content="&amp;#x6700;&amp;#x8FD1;&amp;#x5728;&amp;#x5B66;&amp;#x4E60;&amp;#x5982;&amp;#x4F55;&amp;#x7528;UML&amp;#x5BF9;&amp;#x7CFB;&amp;#x7EDF;&amp;#x8FDB;&amp;#x884C;&amp;#x5EFA;&amp;#x6A21;&amp;#xFF0C;&amp;#x5176;&amp;#x5B9E;&amp;#x4E24;&amp;#x4E09;&amp;#x5E74;&amp;#x524D;&amp;#x5C31;&amp;#x8BD5;&amp;#x">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Mist',
    sidebar: {"position":"left","display":"post","offset":12,"offset_float":0,"b2t":false,"scrollpercent":false},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '0',
      author: 'Author'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="jack2gs.github.io/2017/12/17/class-note/"/>






  <title>类的理解与总结 | Jack Gao's Blog</title><!-- hexo-inject:begin --><!-- hexo-inject:end -->
  














</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="en">

  
  
    
  

  <!-- hexo-inject:begin --><!-- hexo-inject:end --><div class="container sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/"  class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">Jack Gao's Blog</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">Road & Book</p>
      
  </div>

  <div class="site-nav-toggle">
    <button>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            Home
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            Categories
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            About
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            Archives
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            Tags
          </a>
        </li>
      

      
    </ul>
  

  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
    <link itemprop="mainEntityOfPage" href="jack2gs.github.io/2017/12/17/class-note/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="Jack Gao">
      <meta itemprop="description" content="">
      <meta itemprop="image" content="/images/avatar.jpg">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="Jack Gao's Blog">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">类的理解与总结</h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">Posted on</span>
              
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2017-12-17T19:47:02+08:00">
                2017-12-17
              </time>
            

            
              <span class="post-meta-divider">|</span>
            

            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-check-o"></i>
              </span>
              
                <span class="post-meta-item-text">Post modified</span>
              
              <time title="Post modified" itemprop="dateModified" datetime="2018-03-17T00:13:04+08:00">
                2018-03-17
              </time>
            
          </span>

          
            <span class="post-category" >
            
              <span class="post-meta-divider">|</span>
            
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              
                <span class="post-meta-item-text">In</span>
              
              
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/categories/UML/" itemprop="url" rel="index">
                    <span itemprop="name">UML</span>
                  </a>
                </span>

                
                
              
            </span>
          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    <div class="post-body" itemprop="articleBody">

      
      

      
        <div id="content">
<p>
&#x6700;&#x8FD1;&#x5728;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x7528;UML&#x5BF9;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x5EFA;&#x6A21;&#xFF0C;&#x5176;&#x5B9E;&#x4E24;&#x4E09;&#x5E74;&#x524D;&#x5C31;&#x8BD5;&#x7740;&#x53BB;&#x5B66;&#x4E60;&#x53BB;&#x505A;&#xFF0C;&#x65E0;&#x5948;&#x5F53;&#x65F6;&#x7684;&#x7ECF;&#x9A8C;&#x6BD4;&#x8F83;&#x5C11;&#xFF0C;&#x7406;&#x89E3;&#x80FD;&#x529B;&#x6709;&#x9650;&#x3002;&#x7ECF;&#x8FC7;&#x8FD9;&#x51E0;&#x5E74;&#x7684;&#x5F00;&#x53D1;&#x5B9E;&#x8DF5;&#xFF0C;&#x73B0;&#x5728;&#x662F;&#x65F6;&#x5019;&#x91CD;&#x65B0;&#x5B66;&#x4E60;&#x4E86;&#x3002;
&#x4F7F;&#x7528;UML&#x5BF9;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x5EFA;&#x6A21;&#x662F;&#x6BCF;&#x4E2A;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x8005;&#x90FD;&#x5E94;&#x8BE5;&#x5B66;&#x4E60;&#x4E0E;&#x638C;&#x63E1;&#x7684;&#x5FC5;&#x5907;&#x6280;&#x80FD;&#x3002;&#x524D;&#x51E0;&#x7BC7;&#x535A;&#x5BA2;&#xFF0C;&#x6709;&#x51E0;&#x7BC7;&#x662F;&#x5173;&#x4E8E;&#x5982;&#x4F55;&#x7528;PlantUML&#x7ED8;&#x5236;UML&#x56FE;&#x7684;&#xFF0C;&#x4E5F;&#x5F88;&#x6709;&#x610F;&#x601D;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x6211;&#x5C06;&#x6682;&#x65F6;&#x4E2D;&#x6B62;PlantUMl&#x7684;&#x5B66;&#x4E60;&#x3002;
&#x6BD5;&#x7ADF;&#x5B83;&#x53EA;&#x662F;&#x4E00;&#x4E2A;UML&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x5DE5;&#x5177;&#x6709;&#x5F88;&#x591A;&#x79CD;&#xFF0C;&#x4F46;&#x7406;&#x662F;&#x4E0D;&#x53D8;&#x7684;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x8FD1;&#x4E00;&#x4E24;&#x4E2A;&#x6708;&#x5C06;&#x96C6;&#x4E2D;&#x5B66;&#x4E60;&#x4E0B;UML&#x7684;&#x7406;&#x8BBA;&#x77E5;&#x8BC6;&#xFF0C;Grady Booch&#x7684;&#x300A;UML&#x7528;&#x6237;&#x6307;&#x5357;&#x300B;&#x662F;&#x672C;&#x4E0D;&#x9519;&#x7684;&#x4E66;&#x3002;
&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x51E0;&#x7BC7;&#x535A;&#x5BA2;&#x5C06;&#x662F;&#x6211;&#x5B66;&#x4E60;&#x8FC7;&#x7A0B;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x4E9B;&#x601D;&#x8003;&#xFF0C;&#x603B;&#x7ED3;&#x4E0E;&#x7B14;&#x8BB0;&#x3002;&#x4E00;&#x6765;&#x5907;&#x5FD8;&#x800C;&#x6765;&#x4E0E;&#x5404;&#x4F4D;&#x5206;&#x4EAB;&#x3002;&#x672C;&#x6587;&#x662F;&#x5BF9;&#x7B2C;&#x56DB;&#x7AE0;&#x7C7B;&#x7684;&#x4E00;&#x4E9B;&#x601D;&#x8003;&#x4E0E;&#x603B;&#x7ED3;&#x3002;
</p>
<a id="more"></a>

<div id="outline-container-org9c49c0d" class="outline-2">
<h2 id="org9c49c0d"><span class="section-number-2">1</span> &#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x5EFA;&#x6A21;&#x7684;&#x9690;&#x55BB;</h2>
<div class="outline-text-2" id="text-1">
<p>
&#x67B6;&#x6784;&#xFF08;Architecture&#xFF09;&#x8FD9;&#x4E2A;&#x5728;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;&#x7684;&#x8BCD;&#x6C47;&#x6700;&#x65E9;&#x6E90;&#x4E8E;&#x5EFA;&#x7B51;&#x5DE5;&#x7A0B;&#x3002;&#x901A;&#x8FC7;&#x5BF9;&#x5EFA;&#x7B51;&#x5DE5;&#x7A0B;&#x5EFA;&#x6A21;&#x7684;&#x63CF;&#x8FF0;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x7406;&#x89E3;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x5EFA;&#x6A21;&#x3002;
</p>
<blockquote>
<p>
&#x5047;&#x5982;&#x6B63;&#x5728;&#x5047;&#x9020;&#x4E00;&#x6240;&#x623F;&#x5B50;&#xFF0C;&#x90A3;&#x4E48;&#x50CF;&#x5899;&#x3001;&#x95E8;&#x3001;&#x7A97;&#x6237;&#x3001;&#x6A71;&#x67DC;&#x548C;&#x706F;&#x5BF9;&#x4E8E;&#x623F;&#x4E3B;&#x6765;&#x8BF4;&#x662F;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#x52A1;&#x3002;&#x8FD9;&#x4E9B;&#x4E8B;&#x52A1;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x90FD;&#x6709;&#x522B;&#x4E8E;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#xFF0C;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x7EC4;&#x7279;&#x6027;&#x3002;&#x5899;&#x6709;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#xFF0C;&#x662F;&#x7ACB;&#x4F53;&#x7684;&#x3002;
&#x95E8;&#x6709;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#xFF0C;&#x4E5F;&#x662F;&#x7ACB;&#x4F53;&#x7684;&#xFF0C;&#x4F46;&#x5B83;&#x8FD8;&#x6709;&#x989D;&#x5916;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x80FD;&#x671D;&#x4E00;&#x4E2A;&#x65B9;&#x5411;&#x6253;&#x5F00;&#x3002;&#x7A97;&#x6237;&#x548C;&#x4EEC;&#x7C7B;&#x4F3C;&#xFF0C;&#x4E8C;&#x8005;&#x90FD;&#x662F;&#x5728;&#x5899;&#x4E0A;&#x5F00;&#x7684;&#x6D1E;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x7A0D;&#x6709;&#x4E0D;&#x540C;&#x3002;&#x7A97;&#x6237;&#x901A;&#x5E38;&#xFF08;&#x4F46;&#x4E0D;&#x603B;&#x662F;&#xFF09;&#x8BBE;&#x8BA1;&#x5F97;&#x8BA9;&#x4EBA;&#x80FD;&#x5411;&#x5916;&#x770B;&#xFF0C;
&#x800C;&#x4E0D;&#x662F;&#x8BA9;&#x4EBA;&#x7A7F;&#x884C;&#x3002;
</p>

<p>
<b>&#x5899;&#x3001;&#x95E8;&#x548C;&#x7A97;&#x6237;&#x5F88;&#x5C11;&#x4F5C;&#x4E3A;&#x4E2A;&#x4F53;&#x5355;&#x72EC;&#x5B58;&#x5728;&#xFF0C;&#x56E0;&#x6B64;&#x8FD8;&#x5FC5;&#x987B;&#x8981;&#x8003;&#x8651;&#x600E;&#x6837;&#x628A;&#x8FD9;&#x4E9B;&#x4E8B;&#x52A1;&#x7684;&#x5177;&#x4F53;&#x4E8B;&#x4F8B;&#x7EC4;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x3002;&#x8BC6;&#x522B;&#x4E8B;&#x52A1;&#x548C;&#x9009;&#x62E9;&#x4ED6;&#x4EEC;&#x4E4B;&#x95F4;&#x6240;&#x8981;&#x5EFA;&#x7ACB;&#x7684;&#x5173;&#x7CFB;&#x5C06;&#x53D7;&#x4E0B;&#x8FF0;&#x56E0;&#x7D20;&#x5F71;&#x54CD;&#xFF1A;&#x5E0C;&#x671B;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x4F4F;&#x5B85;&#x7684;&#x5404;&#x4E2A;&#x623F;&#x95F4;&#xFF0C;
&#x5E0C;&#x671B;&#x5404;&#x4E2A;&#x623F;&#x95F4;&#x5982;&#x4F55;&#x8054;&#x901A;&#xFF0C;&#x4EE5;&#x53CA;&#x5E0C;&#x671B;&#x8FD9;&#x79CD;&#x5E03;&#x5C40;&#x6240;&#x5F62;&#x6210;&#x7684;&#x603B;&#x4F53;&#x98CE;&#x683C;&#x548C;&#x611F;&#x89C9;&#x3002;</b>
</p>

<p>
&#x7528;&#x6237;&#x6240;&#x5173;&#x5FC3;&#x7684;&#x5931;&#x8BEF;&#x5404;&#x4E0D;&#x76F8;&#x540C;&#x3002;&#x674E;&#x5112;&#xFF0C;&#x5E2E;&#x52A9;&#x5EFA;&#x623F;&#x7684;&#x6C34;&#x7BA1;&#x5DE5;&#x5BF9;&#x6392;&#x6C34;&#x7BA1;&#x3001;&#x5B58;&#x6C34;&#x5F2F;&#x548C;&#x901A;&#x98CE;&#x53E3;&#x4E4B;&#x7C7B;&#x7684;&#x4E8B;&#x52A1;&#x611F;&#x5174;&#x8DA3;&#x3002;&#x4F5C;&#x4E3A;&#x623F;&#x4E3B;&#xFF0C;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x5173;&#x5FC3;&#x8FD9;&#x4E9B;&#x4E8B;&#x52A1;&#xFF0C;&#x53EA;&#x9700;&#x5173;&#x5FC3;&#x6C34;&#x7BA1;&#x5DE5;&#x5BF9;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x7684;&#x65BD;&#x5DE5;&#x8981;&#x6EE1;&#x8DB3;&#x8981;&#x6C42;&#xFF0C;
&#x4F8B;&#x5982;&#xFF0C;&#x6392;&#x6C34;&#x7BA1;&#x8981;&#x5B89;&#x88C5;&#x5728;&#x5730;&#x4E0B;&#xFF0C;&#x901A;&#x98CE;&#x53E3;&#x8981;&#x7A7F;&#x8FC7;&#x5C4B;&#x9876;&#x3002;
</p>
</blockquote>

<p>
&#x8BF4;&#x767D;&#x4E86;&#xFF0C;&#x5EFA;&#x6A21;&#x5C31;&#x662F;&#x4E00;&#x79CD;&#x62BD;&#x8C61;&#xFF0C; <b>&#x5B83;&#x8DDF;&#x89C2;&#x5BDF;&#x8005;&#x7684;&#x89D2;&#x5EA6;&#x6709;&#x5173;</b> &#x3002;&#x8FD9;&#x4E5F;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;UML&#x6709;4+1&#x89C6;&#x56FE;&#x6A21;&#x578B;&#x7684;&#x539F;&#x56E0;&#x3002;&#x56E0;&#x4E3A;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x6D89;&#x53CA;&#x5230;&#x5F88;&#x591A;&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x6BCF;&#x4E2A;&#x89D2;&#x8272;&#x7684;&#x4E13;&#x6CE8;&#x70B9;&#x4E0D;&#x540C;&#xFF0C;&#x62BD;&#x8C61;&#x4E5F;&#x5C31;&#x4E0D;&#x540C;&#x3002;
&#x4F8B;&#x5982;&#xFF0C;&#x9700;&#x6C42;&#x5206;&#x6790;&#x4EBA;&#x5458;&#x5BF9;&#x7528;&#x4F8B;&#x56FE;&#x6BD4;&#x8F83;&#x611F;&#x5174;&#x8DA3;&#x800C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5BF9;&#x903B;&#x8F91;&#x89C6;&#x56FE;&#x3001;&#x8FC7;&#x7A0B;&#x89C6;&#x56FE;&#x6BD4;&#x8F83;&#x611F;&#x5174;&#x8DA3;&#x3002;
</p>

<blockquote>
<p>
An abstraction denotes the essential characteristics of an object that distinguish it
from all other kinds of objects and thus provide crisply defined conceptual
boundaries, relative to the perspective of the viewer.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org335a846" class="outline-2">
<h2 id="org335a846"><span class="section-number-2">2</span> &#x7C7B;&#x7684;&#x672F;&#x8BED;&#x548C;&#x6982;&#x5FF5;</h2>
<div class="outline-text-2" id="text-2">
<p>
&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x662F;&#x4E00;&#x4E2A;&#x4ECE;&#x903B;&#x8F91;&#x62BD;&#x8C61;&#x5230;&#x7269;&#x7406;&#x5B9E;&#x73B0;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x5728;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x7C7B;&#x662F;&#x62BD;&#x8C61;&#x8FC7;&#x7A0B;&#x4E2D;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x4E2A;&#x6982;&#x5FF5;&#xFF0C;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x6700;&#x91CD;&#x8981;&#x7684;&#x6784;&#x9020;&#x5757;&#x3002;
</p>
<blockquote>
<p>
&#x7C7B;&#x662F;&#x5BF9;&#x4E00;&#x7EC4;&#x5177;&#x6709;&#x76F8;&#x540C;&#x5C5E;&#x6027;&#x3001;&#x64CD;&#x4F5C;&#x3001;&#x5173;&#x7CFB;&#x548C;&#x8BED;&#x4E49;&#x7684;&#x5BF9;&#x8C61;&#x7684;&#x63CF;&#x8FF0;&#x3002;&#x4E00;&#x4E2A;&#x7C7B;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x63A5;&#x53E3;&#x3002;&#x7ED3;&#x6784;&#x826F;&#x597D;&#x7684;&#x7C7B;&#x5177;&#x6709;&#x6E05;&#x6670;&#x7684;&#x8FB9;&#x754C;&#xFF0C;&#x5E76;&#x5F62;&#x6210;&#x4E86;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x804C;&#x8D23;&#x5747;&#x8861;&#x5206;&#x5E03;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;
</p>
</blockquote>

<p>
&#x4ECE;&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x7C7B;&#x662F;&#x63CF;&#x8FF0;&#x5BF9;&#x8C61;&#x7684;&#x5143;&#x6570;&#x636E;&#xFF08;Meta Data&#xFF09;&#xFF0C;&#x6211;&#x662F;&#x8FD9;&#x6837;&#x8BA4;&#x4E3A;&#x7684;&#x3002;
</p>
</div>

<div id="outline-container-org9ed0167" class="outline-3">
<h3 id="org9ed0167"><span class="section-number-3">2.1</span> &#x540D;&#x79F0;</h3>
<div class="outline-text-3" id="text-2-1">
<blockquote>
<p>
&#x6BCF;&#x4E2A;&#x7C7B;&#x90FD;&#x5FC5;&#x987B;&#x6709;&#x4E00;&#x4E2A;&#x6709;&#x522B;&#x4E8E;&#x5176;&#x4ED6;&#x7C7B;&#x7684;&#x540D;&#x79F0;&#x3002;&#x540D;&#x79F0;&#xFF08;name&#xFF09;&#x662F;&#x4E00;&#x4E2A;&#x6587;&#x5B57;&#x4E32;&#x3002;&#x5355;&#x72EC;&#x7684;&#x540D;&#x79F0;&#x53EB;&#x505A;&#x7B80;&#x5355;&#x540D;&#xFF0C;&#x6709;&#x7C7B;&#x6240;&#x5728;&#x7684;&#x5305;&#x7684;&#x540D;&#x79F0;&#x4F5C;&#x4E3A;&#x6D45;&#x9189;&#x7684;&#x7C7B;&#x540D;&#x53EB;&#x505A;&#x9650;&#x5B9A;&#x540D;&#x3002;
</p>
</blockquote>
<p>
&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x7C7B;&#x540D;&#x79F0;&#x4E00;&#x822C;&#x7531;&#x9996;&#x5B57;&#x6BCD;&#x5927;&#x5C0F;&#x7684;&#x7B80;&#x5355;&#x540D;&#x8BCD;&#x6216;&#x8005;&#x540D;&#x8BCD;&#x77ED;&#x8BED;&#x7EC4;&#x6210;&#x3002;
</p>
</div>
</div>
<div id="outline-container-orgd6f0d37" class="outline-3">
<h3 id="orgd6f0d37"><span class="section-number-3">2.2</span> &#x5C5E;&#x6027;</h3>
<div class="outline-text-3" id="text-2-2">
<blockquote>
<p>
&#x5C5E;&#x6027;&#xFF08;attribute&#xFF09;&#x662F;&#x5DF2;&#x547D;&#x540D;&#x7684;&#x7C7B;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x5B83;&#x63CF;&#x8FF0;&#x4E86;&#x8BE5;&#x7279;&#x6027;&#x7684;&#x5B9E;&#x4F8B;&#x53EF;&#x4EE5;&#x53D6;&#x503C;&#x7684;&#x8303;&#x56F4;&#x3002;&#x7C7B;&#x53EF;&#x4EE5;&#x6709;&#x4EFB;&#x610F;&#x6570;&#x76EE;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x6CA1;&#x6709;&#x5C5E;&#x6027;&#x3002;&#x5C5E;&#x6027;&#x63CF;&#x8FF0;&#x4E86;&#x6B63;&#x88AB;&#x5EFA;&#x6A21;&#x7684;&#x5931;&#x8BEF;&#x7684;&#x4E00;&#x4E9B;&#x7279;&#x6027;&#xFF0C;
&#x8FD9;&#x4E9B;&#x7279;&#x6027;&#x4E3A;&#x7C7B;&#x7684;&#x6240;&#x6709;&#x5BF9;&#x8C61;&#x6240;&#x5171;&#x6709;&#x3002;&#x4F8B;&#x5982;&#x6BCF;&#x4E00;&#x9762;&#x5899;&#x90FD;&#x6709;&#x9AD8;&#x5EA6;&#x3001;&#x5BBD;&#x5EA6;&#x548C;&#x539A;&#x5EA6;&#x3002;
</p>
</blockquote>
<p>
&#x547D;&#x540D;&#x89C4;&#x5219;&#x4E0E;&#x540D;&#x79F0;&#x7C7B;&#x4F3C;&#xFF0C;&#x90FD;&#x662F;&#x7531;&#x7B80;&#x5355;&#x540D;&#x8BCD;&#x6216;&#x8005;&#x540D;&#x8BCD;&#x77ED;&#x8BED;&#x6765;&#x547D;&#x540D;&#x3002;
</p>
</div>
</div>
<div id="outline-container-org8acccd8" class="outline-3">
<h3 id="org8acccd8"><span class="section-number-3">2.3</span> &#x64CD;&#x4F5C;</h3>
<div class="outline-text-3" id="text-2-3">
<blockquote>
<p>
&#x64CD;&#x4F5C;&#xFF08;operation&#xFF09;&#x662F;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x8BE5;&#x670D;&#x52A1;&#x53EF;&#x4EE5;&#x7531;&#x4EFB;&#x4F55;&#x7C7B;&#x7684;&#x5BF9;&#x8C61;&#x6765;&#x8BF7;&#x6C42;&#x4EE5;&#x5F71;&#x54CD;&#x5176;&#x884C;&#x4E3A;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x64CD;&#x4F5C;&#x662F;&#x80FD;&#x5BF9;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x6240;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x7684;&#x62BD;&#x8C61;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x7531;&#x8FD9;&#x4E2A;&#x7C7B;&#x7684;&#x6240;&#x6709;&#x5BF9;&#x8C61;&#x5171;&#x4EAB;&#x3002;
&#x7C7B;&#x53EF;&#x4EE5;&#x6709;&#x4EFB;&#x610F;&#x6570;&#x636E;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x6CA1;&#x6709;&#x64CD;&#x4F5C;&#x3002;
</p>
</blockquote>

<p>
&#x5F53;&#x7ED9;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x53D1;&#x9001;&#x6D88;&#x606F;&#x65F6;&#xFF0C;&#x8BE5;&#x6D88;&#x606F;&#x5FC5;&#x987B;&#x662F;&#x7C7B;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x7684;&#xFF0C;&#x8FD9;&#x624D;&#x662F;&#x597D;&#x7684;&#x7CFB;&#x7EDF;&#x9690;&#x55BB;&#xFF0C;&#x4E5F;&#x662F;&#x624D;&#x662F;&#x5408;&#x7406;&#x7684;&#x3002;
</p>
</div>
</div>

<div id="outline-container-org37737a4" class="outline-3">
<h3 id="org37737a4"><span class="section-number-3">2.4</span> &#x5BF9;&#x5C5E;&#x6027;&#x548C;&#x64CD;&#x4F5C;&#x7684;&#x7EC4;&#x7EC7;</h3>
<div class="outline-text-3" id="text-2-4">
<blockquote>
<p>
&#x5728;&#x753B;&#x4E00;&#x4E2A;&#x7C7B;&#x662F;&#xFF0C;&#x4E0D;&#x5FC5;&#x540C;&#x65F6;&#x628A;&#x6240;&#x6709;&#x7684;&#x5C5E;&#x6027;&#x548C;&#x64CD;&#x4F5C;&#x90FD;&#x663E;&#x793A;&#x51FA;&#x6765;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5728;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x4E0D;&#x80FD;&#x8FD9;&#x6837;&#x505A;&#xFF08;&#x7531;&#x4E8E;&#x5C5E;&#x6027;&#x548C;&#x64CD;&#x4F5C;&#x592A;&#x591A;&#x4EE5;&#x81F3;&#x4E8E;&#x65E0;&#x6CD5;&#x628A;&#x4ED6;&#x4EEC;&#x653E;&#x5728;&#x4E00;&#x5F20;&#x56FE;&#x4E2D;&#xFF09;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x4E0D;&#x5E94;&#x8BE5;&#x8FD9;&#x6837;&#x505A;&#xFF08; <b>&#x53EF;&#x80FD;&#x53EA;&#x6709;&#x8FD9;&#x4E9B;&#x5C5E;&#x6027;&#x548C;&#x64CD;&#x4F5C;&#x7684;&#x4E00;&#x4E2A;&#x5B50;&#x96C6;&#x4E0E;&#x7279;&#x5B9A;&#x7684;&#x89C6;&#x56FE;&#x76F8;&#x5173;</b> &#xFF09;&#x3002;
&#x6240;&#x4EE5;&#xFF0C;&#x7A7A;&#x680F;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x610F;&#x5473;&#x7740;&#x6CA1;&#x6709;&#x5C5E;&#x6027;&#x6216;&#x64CD;&#x4F5C;&#xFF0C;&#x53EA;&#x662F;&#x6CA1;&#x6709;&#x9009;&#x62E9;&#x8981;&#x663E;&#x793A;&#x4ED6;&#x4EEC;&#x3002;
</p>

<p>
&#x4E3A;&#x4E86;&#x66F4;&#x597D;&#x5730;&#x7EC4;&#x7EC7;&#x5C5E;&#x6027;&#x548C;&#x64CD;&#x4F5C;&#x7684;&#x957F;&#x5217;&#x8868;&#xFF0C;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x6784;&#x9020;&#x578B;&#xFF08;Stereotype)&#x5728;&#x6BCF;&#x4E00;&#x7EC4;&#x5C5E;&#x6027;&#x548C;&#x64CD;&#x4F5C;&#x4E4B;&#x524D;&#x52A0;&#x4E00;&#x4E2A;&#x63CF;&#x8FF0;&#x5176;&#x79CD;&#x7C7B;&#x7684;&#x524D;&#x7F00;&#x3002;
</p>
</blockquote>
<p>
&#x539F;&#x6587;&#x7FFB;&#x8BD1;&#x6210; <b>&#x884D;&#x578B;</b> &#xFF0C;&#x4E0D;&#x8FC7;&#x6211;&#x8FD8;&#x662F;&#x89C9;&#x5F97; <b>&#x6784;&#x9020;&#x578B;</b> &#x987A;&#x53E3;, &#x56E0;&#x6B64;&#x4EE5;&#x540E;&#x90FD;&#x79F0;&#x4E4B;&#x4E3A;&#x6784;&#x9020;&#x578B;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x7531;&#x4E8E;&#x62BD;&#x8C61;&#x8DDF;&#x89C2;&#x5BDF;&#x8005;&#x7684;&#x89D2;&#x5EA6;&#x6709;&#x5173;&#xFF0C;&#x56E0;&#x6B64;&#x6709;&#x9009;&#x62E9;&#x5730;&#x663E;&#x793A;&#x89C2;&#x5BDF;&#x8005;&#x6240;&#x5173;&#x6CE8;&#x7684;&#x5C5E;&#x6027;&#x548C;&#x64CD;&#x4F5C;&#x3002;
</p>
</div>
</div>

<div id="outline-container-org519e17b" class="outline-3">
<h3 id="org519e17b"><span class="section-number-3">2.5</span> &#x804C;&#x8D23;</h3>
<div class="outline-text-3" id="text-2-5">
<p>
&#x5BF9;&#x7C7B;&#x5EFA;&#x6A21;&#x7684;&#x4E00;&#x4E2A;&#x53F7;&#x7684;&#x8D77;&#x70B9;&#x662F;&#x8BE6;&#x8FF0;&#x8BCD;&#x6C47;&#x8868;&#x4E2D;&#x7684;&#x4E8B;&#x52A1;&#x7684;&#x804C;&#x8D23;&#x3002;&#x50CF;CRC&#x5361;&#x548C;&#x57FA;&#x4E8E;&#x7528;&#x4F8B;&#x7684;&#x5206;&#x6790;&#x6280;&#x672F;&#x5728;&#x8FD9;&#x91CC;&#x7279;&#x522B;&#x6709;&#x7528;&#x3002;&#x5F53;&#x7CBE;&#x5316;&#x6A21;&#x578B;&#x65F6;&#xFF0C;&#x8981;&#x628A;&#x8FD9;&#x4E9B;&#x804C;&#x8D23;&#x8F6C;&#x6362;&#x6210;&#x80FD;&#x5F88;&#x597D;&#x5730;&#x5B8C;&#x6210;&#x8FD9;&#x4E9B;&#x804C;&#x8D23;&#x7684;&#x4E00;&#x7EC4;&#x5C5E;&#x6027;&#x548C;&#x64CD;&#x4F5C;&#x3002;
&#x5728;&#x56FE;&#x5F62;&#x4E0A;&#xFF0C;&#x628A;&#x804C;&#x8D23;&#x5217;&#x5728;&#x56FE;&#x5F62;&#x7B26;&#x5E95;&#x90E8;&#x7684;&#x5355;&#x72EC;&#x7684;&#x680F;&#x4E2D;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x4E0E;&#x5C5E;&#x6027;&#x548C;&#x64CD;&#x4F5C;&#x4E00;&#x6837;&#xFF0C;&#x5355;&#x72EC;&#x5360;&#x4E00;&#x680F;&#x3002;
</p>
</div>
</div>
<div id="outline-container-org0f0081a" class="outline-3">
<h3 id="org0f0081a"><span class="section-number-3">2.6</span> &#x5176;&#x4ED6;&#x7279;&#x5F81;</h3>
<div class="outline-text-3" id="text-2-6">
<p>
&#x4F8B;&#x5982;&#x5C5E;&#x6027;&#x548C;&#x64CD;&#x4F5C;&#x7684;&#x53EF;&#x89C1;&#x6027;&#xFF1B;&#x4E0E;&#x7279;&#x5B9A;&#x8BED;&#x8A00;&#x76F8;&#x5173;&#x7684;&#x64CD;&#x4F5C;&#x7279;&#x5F81;&#xFF0C;&#x4F8B;&#x5982;&#x591A;&#x6001;&#x7684;&#x6216;&#x8005;&#x9759;&#x6001;&#x7684;&#x3002;&#x53E6;&#x5916;&#x7C7B;&#x4E5F;&#x6709;&#x5185;&#x90E8;&#x7ED3;&#x6784;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x7C7B;&#x7684;&#x5185;&#x90E8;&#x7ED3;&#x6784;&#x56FE;&#x63CF;&#x8FF0;&#x5C5E;&#x6027;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3002;
</p>
</div>
</div>
</div>
<div id="outline-container-org2c23f15" class="outline-2">
<h2 id="org2c23f15"><span class="section-number-2">3</span> &#x5E38;&#x7528;&#x7684;&#x5EFA;&#x6A21;&#x6280;&#x672F;</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgd29e437" class="outline-3">
<h3 id="orgd29e437"><span class="section-number-3">3.1</span> &#x5BF9;&#x7CFB;&#x7EDF;&#x7684;&#x8BCD;&#x6C47;&#x5EFA;&#x6A21;</h3>
<div class="outline-text-3" id="text-3-1">
<blockquote>
<p>
&#x4E3A;&#x4E86;&#x5BF9;&#x7CFB;&#x7EDF;&#x7684;&#x8BCD;&#x6C47;&#x5EFA;&#x6A21;&#xFF0C;&#x9700;&#x505A;&#x5982;&#x4E0B;&#x5DE5;&#x4F5C;&#xFF1A;
</p>
<ul class="org-ul">
<li>&#x8BC6;&#x522B;&#x7528;&#x6237;&#x6216;&#x5B9E;&#x73B0;&#x8005;&#x7528;&#x4E8E;&#x63CF;&#x8FF0;&#x95EE;&#x9898;&#x6216;&#x8005;&#x63CF;&#x8FF0;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x90A3;&#x4E9B; <b>&#x4E8B;&#x52A1;</b> &#x3002;&#x7528;CRC&#x5361;&#x548C;&#x57FA;&#x4E8E;&#x7528;&#x4F8B;&#x5206;&#x6790;&#x7684;&#x6280;&#x672F;&#x5E2E;&#x52A9;&#x7528;&#x6237;&#x53D1;&#x73B0;&#x8FD9;&#x4E9B;&#x62BD;&#x8C61;&#x3002;</li>
<li>&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x62BD;&#x8C61;&#xFF0C;&#x8BC6;&#x522B;&#x4E00;&#x4E2A; <b>&#x804C;&#x8D23;&#x96C6;</b> &#x3002;&#x786E;&#x4FDD;&#x80FD;&#x6E05;&#x695A;&#x5730;&#x5B9A;&#x4E49;&#x6BCF;&#x4E2A;&#x7C7B;&#xFF0C;&#x800C;&#x4E14;&#x8FD9;&#x4E9B;&#x804C;&#x8D23;&#x80FD;&#x5728;&#x6240;&#x6709;&#x7684;&#x7C7B;&#x4E4B;&#x95F4;&#x5F88;&#x597D;&#x5730;&#x5747;&#x8861;&#x3002;</li>
<li>&#x63D0;&#x4F9B;&#x4E3A;&#x5B9E;&#x73B0;&#x6BCF;&#x4E2A;&#x7C7B;&#x7684;&#x804C;&#x8D23;&#x6240;&#x9700;&#x8981;&#x7684; <b>&#x5C5E;&#x6027;&#x548C;&#x64CD;&#x4F5C;</b> &#x3002;</li>
</ul>
</blockquote>
<p>
&#x5176;&#x5B9E;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x73AF;&#x73AF;&#x76F8;&#x6263;&#x7684;&#xFF1A; &#x8BC6;&#x522B; <b>&#x4E8B;&#x52A1;</b> -&gt; &#x627E;&#x51FA; <b>&#x804C;&#x8D23;&#x96C6;</b> -&gt; &#x5C06;&#x804C;&#x8D23;&#x8F6C;&#x5316;&#x4E3A; <b>&#x5C5E;&#x6027;&#x548C;&#x64CD;&#x4F5C;</b> 
</p>
<blockquote>
<p>
&#x968F;&#x7740;&#x6A21;&#x578B;&#x7684;&#x4E0D;&#x65AD;&#x589E;&#x5927;&#xFF0C;&#x6240;&#x53D1;&#x73B0;&#x7684;&#x5F88;&#x591A;&#x7C7B;&#x5C06;&#x8D8B;&#x4E8E;&#x851F;&#x96C6;&#x5230;&#x4E00;&#x4E9B;&#x6982;&#x5FF5;&#x548C;&#x8BED;&#x4E49;&#x4E0A;&#x76F8;&#x5173;&#x7684;&#x7EC4;&#x4E2D;&#x3002;&#x5728;UML&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x5305;&#x6765;&#x5BF9;&#x8FD9;&#x4E9B;&#x7C7B;&#x7C07;&#x5EFA;&#x6A21;&#x3002;
</p>
</blockquote>
<p>
&#x5176;&#x5B9E;&#x4E00;&#x5207;&#x90FD;&#x662F;&#x90A3;&#x4E48;&#x81EA;&#x7136;&#xFF0C;&#x7C7B;&#x8FC7;&#x591A;&#x65F6;&#x4F1A;&#x53D8;&#x5F97;&#x6742;&#x4E71;&#x4E0D;&#x582A;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x5305;&#x8FDB;&#x884C;&#x7EC4;&#x7EC7;&#x3002;&#x5206;&#x89E3;&#xFF0C;&#x62BD;&#x8C61;&#xFF0C;&#x5206;&#x7C7B;&#x662F;&#x89E3;&#x51B3;&#x590D;&#x6742;&#x95EE;&#x9898;&#x7684;&#x57FA;&#x672C;&#x624B;&#x6BB5;&#x3002;
</p>
</div>
</div>
<div id="outline-container-org45f9508" class="outline-3">
<h3 id="org45f9508"><span class="section-number-3">3.2</span> &#x5BF9;&#x7CFB;&#x7EDF;&#x7684;&#x804C;&#x8D23;&#x5206;&#x5E03;&#x5EFA;&#x6A21;</h3>
<div class="outline-text-3" id="text-3-2">
<blockquote>
<p>
&#x5BF9;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x804C;&#x8D23;&#x5206;&#x5E03;&#x5EFA;&#x6A21;&#xFF0C;&#x8981;&#x505A;&#x5982;&#x4E0B;&#x5DE5;&#x4F5C;&#xFF1A;
</p>
<ul class="org-ul">
<li>&#x8BC6;&#x522B;&#x4E00;&#x7EC4;&#x4E3A;&#x4E86;&#x5B8C;&#x6210;&#x67D0;&#x4E9B;&#x884C;&#x4E3A;&#x800C;&#x7D27;&#x5BC6;&#x5730;&#x534F;&#x540C;&#x5DE5;&#x4F5C;&#x7684;&#x7C7B;&#x3002;</li>
<li>&#x5BF9;&#x4E0A;&#x8FF0;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x7C7B;&#x8BC6;&#x522B;&#x51FA;&#x4E00;&#x7EC4;&#x804C;&#x8D23;&#x3002;</li>
<li>&#x4ECE;&#x6574;&#x4F53;&#x4E0A;&#x60EF;&#x7740;&#x8FD9;&#x7EC4;&#x7C7B;&#xFF0C;&#x628A;&#x804C;&#x8D23;&#x8FC7;&#x591A;&#x7684;&#x7C7B;&#x5206;&#x89E3;&#x6210;&#x8F83;&#x5C0F;&#x7684;&#x62BD;&#x8C61;&#xFF0C;&#x628A;&#x804C;&#x8D23;&#x8FC7;&#x4E8E;&#x7410;&#x788E;&#x7684;&#x5C0F;&#x7C7B;&#x5408;&#x5E76;&#x6210;&#x8F83;&#x5927;&#x7684;&#x7C7B;&#xFF0C;&#x91CD;&#x65B0;&#x5206;&#x914D;&#x804C;&#x8D23;&#x4EE5;&#x4F7F;&#x6BCF;&#x4E00;&#x4E2A;&#x62BD;&#x8C61;&#x5408;&#x7406;&#x5730;&#x5B58;&#x5728;&#x3002;</li>
<li>&#x8003;&#x8651;&#x8FD9;&#x4E9B;&#x7C7B;&#x7684;&#x76F8;&#x4E92;&#x534F;&#x4F5C;&#x65B9;&#x5F0F;&#xFF0C;&#x76F8;&#x5E94;&#x5730;&#x91CD;&#x65B0;&#x5206;&#x914D;&#x4ED6;&#x4EEC;&#x7684;&#x804C;&#x8D23;&#xFF0C;&#x4F7F;&#x534F;&#x4F5C;&#x4E2D;&#x6CA1;&#x6709;&#x54EA;&#x4E2A;&#x7C7B;&#x7684;&#x804C;&#x8D23;&#x8FC7;&#x591A;&#x6216;&#x8005;&#x8FC7;&#x5C11;&#x3002;</li>
</ul>
</blockquote>
<p>
&#x6211;&#x8BA4;&#x4E3A;&#xFF1A;
</p>
<ol class="org-ol">
<li>&#x8FD9;&#x91CC;&#x4E5F;&#x9700;&#x8981;&#x8003;&#x8651;&#x7CFB;&#x7EDF;&#x9690;&#x55BB;</li>
<li>&#x5E73;&#x8861;&#x7C7B;&#x7684;&#x804C;&#x8D23;&#x5728;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x8DDF;&#x4EE3;&#x7801;&#x7684;&#x53EF;&#x6D4B;&#x8BD5;&#x6027;&#x6709;&#x5173;&#x7CFB;&#xFF0C;&#x4E3A;&#x4E86;&#x4F7F;&#x7C7B;&#x66F4;&#x5177;&#x6709;&#x53EF;&#x6D4B;&#x8BD5;&#x6027;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x9700;&#x8981;&#x8C03;&#x6574;&#x804C;&#x8D23;&#x5206;&#x5E03;&#xFF0C;&#x4F7F;&#x5BF9;&#x8C61;&#x7684;&#x90BB;&#x5C45;&#x5BF9;&#x8C61;&#x4E0D;&#x81F3;&#x4E8E;&#x8FC7;&#x591A;&#x6216;&#x8005;&#x8FC7;&#x5C11;&#x3002;
&#x90BB;&#x5C45;&#x5BF9;&#x8C61;&#x8FC7;&#x591A;&#x610F;&#x5473;&#x7740;&#x8BE5;&#x5BF9;&#x8C61;&#x7684;&#x804C;&#x8D23;&#x592A;&#x5C11;&#xFF0C;&#x53CD;&#x4E4B;&#x610F;&#x5473;&#x7740;&#x8BE5;&#x5BF9;&#x8C61;&#x7684;&#x804C;&#x8D23;&#x592A;&#x591A;&#xFF0C;&#x8FD9;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x90FD;&#x4F1A;&#x964D;&#x4F4E;&#x7C7B;&#x7684;&#x53EF;&#x6D4B;&#x8BD5;&#x6027;&#x3002;
&#x8BF4;&#x767D;&#x4E86;&#xFF0C;&#x5E73;&#x8861;&#x7C7B;&#x7684;&#x804C;&#x8D23;&#x7684;&#x624B;&#x6BB5;&#x6709;&#x4E09;&#x79CD;&#xFF1A;
<ul class="org-ul">
<li>&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#x7C7B;</li>
<li>&#x5C06;&#x4E00;&#x4E2A;&#x5927;&#x7C7B;&#x62C6;&#x5206;&#x6210;&#x591A;&#x4E2A;&#x5C0F;&#x7C7B;</li>
<li>&#x5C06;&#x591A;&#x4E2A;&#x5C0F;&#x7C7B;&#x5408;&#x5E76;&#x6210;&#x4E00;&#x4E2A;&#x8F83;&#x5927;&#x7684;&#x7C7B;</li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-orga7d4003" class="outline-3">
<h3 id="orga7d4003"><span class="section-number-3">3.3</span> &#x5BF9;&#x975E;&#x8F6F;&#x4EF6;&#x4E8B;&#x7269;&#x5EFA;&#x6A21;</h3>
<div class="outline-text-3" id="text-3-3">
<blockquote>
<p>
&#x4E3A;&#x4E86;&#x5BF9;&#x975E;&#x8F6F;&#x4EF6;&#x4E8B;&#x7269;&#x5EFA;&#x6A21;&#xFF0C;&#x8981;&#x505A;&#x5982;&#x4E0B;&#x5DE5;&#x4F5C;&#xFF1A;
</p>
<ul class="org-ul">
<li>&#x5BF9;&#x62BD;&#x8C61;&#x4E3A;&#x7C7B;&#x7684;&#x4E8B;&#x7269;&#x8FDB;&#x884C;&#x5EFA;&#x6A21;&#x3002;</li>
<li>&#x5982;&#x679C;&#x8981;&#x5C06;&#x8FD9;&#x4E9B;&#x975E;&#x8F6F;&#x4EF6;&#x4E8B;&#x7269;&#x4E0E;UML&#x5DF2;&#x5B9A;&#x4E49;&#x7684;&#x6784;&#x9020;&#x5FEB;&#x76F8;&#x533A;&#x522B;&#xFF0C;&#x5C31;&#x8981;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x6784;&#x9020;&#x5FEB;&#xFF0C;&#x7528;&#x6784;&#x9020;&#x578B;&#x8BE6;&#x8FF0;&#x8FD9;&#x4E9B;&#x65B0;&#x8BED;&#x4E49;&#xFF0C;&#x5E76;&#x7ED9;&#x51FA;&#x4E0D;&#x540C;&#x7684;&#x53EF;&#x89C6;&#x5316;&#x63D0;&#x793A;&#x3002;</li>
<li>&#x5982;&#x679C;&#x5EFA;&#x6A21;&#x7684;&#x4E8B;&#x7269;&#x662F;&#x67D0;&#x79CD;&#x672C;&#x8EAB;&#x5305;&#x542B;&#x8F6F;&#x4EF6;&#x7684;&#x786C;&#x4EF6;&#xFF0C;&#x8003;&#x8651;&#x628A;&#x5B83;&#x5EFA;&#x6A21;&#x4E3A;&#x4E00;&#x79CD;&#x7ED3;&#x70B9;&#xFF0C;&#x4EE5;&#x4FBF;&#x80FD;&#x8FDB;&#x4E00;&#x6B65;&#x6269;&#x5145;&#x5B83;&#x7684;&#x7ED3;&#x6784;</li>
</ul>
</blockquote>
<p>
&#x7CFB;&#x7EDF;&#x5916;&#x90E8;&#x7684;&#x4E8B;&#x7269;&#x7ECF;&#x5E38;&#x88AB;&#x5EFA;&#x6A21;&#x4E3A;&#x53C2;&#x4E0E;&#x8005;&#x3002;
</p>
</div>
</div>
<div id="outline-container-orgaf8c066" class="outline-3">
<h3 id="orgaf8c066"><span class="section-number-3">3.4</span> &#x5BF9;&#x7B80;&#x5355;&#x7C7B;&#x578B;&#x8FDB;&#x884C;&#x5EFA;&#x6A21;</h3>
<div class="outline-text-3" id="text-3-4">
<blockquote>
<p>
&#x5BF9;&#x7B80;&#x5355;&#x7C7B;&#x578B;&#x5EFA;&#x6A21;&#xFF0C;&#x8981;&#x505A;&#x5982;&#x4E0B;&#x5DE5;&#x4F5C;&#xFF1A;
</p>
<ul class="org-ul">
<li>&#x5BF9;&#x62BD;&#x8C61;&#x4E3A;&#x7C7B;&#x578B;&#x6216;&#x8005;&#x679A;&#x4E3E;&#x7684;&#x4E8B;&#x7269;&#x8FDB;&#x884C;&#x5EFA;&#x6A21;&#xFF0C;&#x8FD9;&#x53EF;&#x4EE5;&#x7528;&#x5E26;&#x6709;&#x9002;&#x5F53;&#x6784;&#x9020;&#x578B;&#x7684;&#x7C7B;&#x8868;&#x793A;&#x7B26;&#x6765;&#x8868;&#x793A;&#x3002;</li>
<li>&#x82E5;&#x9700;&#x8981;&#x8BE6;&#x8FF0;&#x4E0E;&#x8BE5;&#x7C7B;&#x578B;&#x76F8;&#x8054;&#x7CFB;&#x7684;&#x503C;&#x57DF;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7EA6;&#x675F;&#x3002;</li>
</ul>
</blockquote>
</div>
</div>
</div>

<div id="outline-container-org29a8d54" class="outline-2">
<h2 id="org29a8d54"><span class="section-number-2">4</span> &#x603B;&#x7ED3;</h2>
<div class="outline-text-2" id="text-4">
<p>
&#x8FD9;&#x4E9B;&#x57FA;&#x672C;&#x4E0A;&#x5C31;&#x662F;&#x7B2C;&#x56DB;&#x7AE0;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x6709;&#x4E9B;&#x56FE;&#x7247;&#x6CA1;&#x6765;&#x5F97;&#x53CA;&#x52A0;&#x4E0A;&#x53BB;&#xFF0C;&#x4EE5;&#x540E;&#x6709;&#x673A;&#x4F1A;&#x518D;&#x52A0;&#x4E0A;&#x53BB;&#x5427;&#x3002;
</p>
</div>
</div>
</div>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/UML/" rel="tag"># UML</a>
          
            <a href="/tags/Class/" rel="tag"># Class</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2017/12/10/difference-between-class-and-component/" rel="next" title="类和组件之间的区别">
                <i class="fa fa-chevron-left"></i> 类和组件之间的区别
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2017/12/28/uml-note-of-relation/" rel="prev" title="[UML笔记] UML中的关系">
                [UML笔记] UML中的关系 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            Table of Contents
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            Overview
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/avatar.jpg"
               alt="Jack Gao" />
          <p class="site-author-name" itemprop="name">Jack Gao</p>
           
              <p class="site-description motion-element" itemprop="description">Jack Gao's Blog</p>
          
        </div>
        <nav class="site-state motion-element">

          
            <div class="site-state-item site-state-posts">
              <a href="/archives/">
                <span class="site-state-item-count">23</span>
                <span class="site-state-item-name">posts</span>
              </a>
            </div>
          

          
            
            
            <div class="site-state-item site-state-categories">
              <a href="/categories/index.html">
                <span class="site-state-item-count">19</span>
                <span class="site-state-item-name">categories</span>
              </a>
            </div>
          

          
            
            
            <div class="site-state-item site-state-tags">
              <a href="/tags/index.html">
                <span class="site-state-item-count">35</span>
                <span class="site-state-item-name">tags</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

        


      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#org9c49c0d"><span class="nav-number">1.</span> <span class="nav-text">1 软件系统建模的隐喻</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#org335a846"><span class="nav-number">2.</span> <span class="nav-text">2 类的术语和概念</span></a><ol class="nav-child"><li class="nav-item nav-level-3"><a class="nav-link" href="#org9ed0167"><span class="nav-number">2.1.</span> <span class="nav-text">2.1 名称</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#orgd6f0d37"><span class="nav-number">2.2.</span> <span class="nav-text">2.2 属性</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#org8acccd8"><span class="nav-number">2.3.</span> <span class="nav-text">2.3 操作</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#org37737a4"><span class="nav-number">2.4.</span> <span class="nav-text">2.4 对属性和操作的组织</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#org519e17b"><span class="nav-number">2.5.</span> <span class="nav-text">2.5 职责</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#org0f0081a"><span class="nav-number">2.6.</span> <span class="nav-text">2.6 其他特征</span></a></li></ol></li><li class="nav-item nav-level-2"><a class="nav-link" href="#org2c23f15"><span class="nav-number">3.</span> <span class="nav-text">3 常用的建模技术</span></a><ol class="nav-child"><li class="nav-item nav-level-3"><a class="nav-link" href="#orgd29e437"><span class="nav-number">3.1.</span> <span class="nav-text">3.1 对系统的词汇建模</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#org45f9508"><span class="nav-number">3.2.</span> <span class="nav-text">3.2 对系统的职责分布建模</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#orga7d4003"><span class="nav-number">3.3.</span> <span class="nav-text">3.3 对非软件事物建模</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#orgaf8c066"><span class="nav-number">3.4.</span> <span class="nav-text">3.4 对简单类型进行建模</span></a></li></ol></li><li class="nav-item nav-level-2"><a class="nav-link" href="#org29a8d54"><span class="nav-number">4.</span> <span class="nav-text">4 总结</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy;  2017 - 
  <span itemprop="copyrightYear">2018</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Jack Gao</span>
</div>


<div class="powered-by">
  Powered by <a class="theme-link" href="https://hexo.io">Hexo</a>
</div>

<div class="theme-info">
  Theme -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Mist
  </a>
</div>


        

        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
      </div>
    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  












  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.1"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.1"></script><!-- hexo-inject:begin --><!-- Begin: Injected MathJax -->
<script type="text/x-mathjax-config">
  MathJax.Hub.Config({"tex2jax":{"inlineMath":[["$","$"],["\\(","\\)"]],"skipTags":["script","noscript","style","textarea","pre","code"],"processEscapes":true},"TeX":{"equationNumbers":{"autoNumber":"AMS"}}});
</script>

<script type="text/x-mathjax-config">
  MathJax.Hub.Queue(function() {
    var all = MathJax.Hub.getAllJax(), i;
    for(i=0; i < all.length; i += 1) {
      all[i].SourceElement().parentNode.className += ' has-jax';
    }
  });
</script>

<script type="text/javascript" src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML">
</script>
<!-- End: Injected MathJax -->
<!-- hexo-inject:end -->



  


  




	





  





  





  






  





  

  

  

  

  

  

</body>
</html>
