<!doctype html>



  


<html class="theme-next mist use-motion" lang="en">
<head>
  <!-- hexo-inject:begin --><!-- hexo-inject:end --><meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>









<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />















  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="UML," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.1.1" />






<meta name="description" content="&amp;#x6700;&amp;#x8FD1;&amp;#x53C8;&amp;#x91CD;&amp;#x65B0;&amp;#x5B66;&amp;#x4E60;UML&amp;#x4E86;&amp;#xFF0C;&amp;#x5BF9;&amp;#x4E8E;4+1&amp;#x89C6;&amp;#x56FE;&amp;#x6A21;&amp;#x578B;&amp;#x548C;UML&amp;#x4E2D;&amp;#x5404;&amp;#x79CD;&amp;#x56FE;&amp;#x7684;&amp;#x6620;&amp;#x5C04;&amp;#x51">
<meta name="keywords" content="UML">
<meta property="og:type" content="article">
<meta property="og:title" content="UML4+1视图与各种图之间的映射关系">
<meta property="og:url" content="jack2gs.github.io/2017/12/10/uml-4-plus-1-views/index.html">
<meta property="og:site_name" content="Jack Gao&#39;s Blog">
<meta property="og:description" content="&amp;#x6700;&amp;#x8FD1;&amp;#x53C8;&amp;#x91CD;&amp;#x65B0;&amp;#x5B66;&amp;#x4E60;UML&amp;#x4E86;&amp;#xFF0C;&amp;#x5BF9;&amp;#x4E8E;4+1&amp;#x89C6;&amp;#x56FE;&amp;#x6A21;&amp;#x578B;&amp;#x548C;UML&amp;#x4E2D;&amp;#x5404;&amp;#x79CD;&amp;#x56FE;&amp;#x7684;&amp;#x6620;&amp;#x5C04;&amp;#x51">
<meta property="og:image" content="jack2gs.github.io/2017/12/10/uml-4-plus-1-views/model-system-architecture.png">
<meta property="og:updated_time" content="2017-12-10T13:59:27.851Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="UML4+1视图与各种图之间的映射关系">
<meta name="twitter:description" content="&amp;#x6700;&amp;#x8FD1;&amp;#x53C8;&amp;#x91CD;&amp;#x65B0;&amp;#x5B66;&amp;#x4E60;UML&amp;#x4E86;&amp;#xFF0C;&amp;#x5BF9;&amp;#x4E8E;4+1&amp;#x89C6;&amp;#x56FE;&amp;#x6A21;&amp;#x578B;&amp;#x548C;UML&amp;#x4E2D;&amp;#x5404;&amp;#x79CD;&amp;#x56FE;&amp;#x7684;&amp;#x6620;&amp;#x5C04;&amp;#x51">
<meta name="twitter:image" content="jack2gs.github.io/2017/12/10/uml-4-plus-1-views/model-system-architecture.png">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Mist',
    sidebar: {"position":"left","display":"post","offset":12,"offset_float":0,"b2t":false,"scrollpercent":false},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '0',
      author: 'Author'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="jack2gs.github.io/2017/12/10/uml-4-plus-1-views/"/>






  <title>UML4+1视图与各种图之间的映射关系 | Jack Gao's Blog</title><!-- hexo-inject:begin --><!-- hexo-inject:end -->
  














</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="en">

  
  
    
  

  <!-- hexo-inject:begin --><!-- hexo-inject:end --><div class="container sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/"  class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">Jack Gao's Blog</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">Road & Book</p>
      
  </div>

  <div class="site-nav-toggle">
    <button>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            Home
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            Categories
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            About
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            Archives
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            Tags
          </a>
        </li>
      

      
    </ul>
  

  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
    <link itemprop="mainEntityOfPage" href="jack2gs.github.io/2017/12/10/uml-4-plus-1-views/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="Jack Gao">
      <meta itemprop="description" content="">
      <meta itemprop="image" content="/images/avatar.jpg">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="Jack Gao's Blog">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">UML4+1视图与各种图之间的映射关系</h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">Posted on</span>
              
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2017-12-10T20:45:10+08:00">
                2017-12-10
              </time>
            

            
              <span class="post-meta-divider">|</span>
            

            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-check-o"></i>
              </span>
              
                <span class="post-meta-item-text">Post modified</span>
              
              <time title="Post modified" itemprop="dateModified" datetime="2017-12-10T21:59:27+08:00">
                2017-12-10
              </time>
            
          </span>

          
            <span class="post-category" >
            
              <span class="post-meta-divider">|</span>
            
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              
                <span class="post-meta-item-text">In</span>
              
              
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/categories/UML/" itemprop="url" rel="index">
                    <span itemprop="name">UML</span>
                  </a>
                </span>

                
                
              
            </span>
          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    <div class="post-body" itemprop="articleBody">

      
      

      
        <div id="content">
<p>
&#x6700;&#x8FD1;&#x53C8;&#x91CD;&#x65B0;&#x5B66;&#x4E60;UML&#x4E86;&#xFF0C;&#x5BF9;&#x4E8E;4+1&#x89C6;&#x56FE;&#x6A21;&#x578B;&#x548C;UML&#x4E2D;&#x5404;&#x79CD;&#x56FE;&#x7684;&#x6620;&#x5C04;&#x5173;&#x7CFB;&#x4E0D;&#x662F;&#x5F88;&#x7406;&#x89E3;&#x3002;&#x7ECF;&#x8FC7;&#x67E5;&#x627E;&#x8D44;&#x6599;&#xFF0C;&#x624D;&#x53D1;&#x73B0;&#x5176;&#x5B9E;&#x6CA1;&#x6709;&#x5341;&#x5206;&#x660E;&#x786E;&#x7684;&#x6620;&#x5C04;&#x5173;&#x7CFB;&#x3002;
&#x6CA1;&#x4E2A;&#x4EBA;&#x7684;&#x89C1;&#x89E3;&#x548C;&#x770B;&#x6CD5;&#x5404;&#x4E0D;&#x76F8;&#x540C;&#x3002;&#x73B0;&#x628A;&#x603B;&#x7ED3;&#x5F97;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x5185;&#x5BB9;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#xFF0C;&#x4E00;&#x6765;&#x5907;&#x5FD8;&#xFF0C;&#x4E8C;&#x6765;&#x53EF;&#x4EE5;&#x4E0E;&#x5927;&#x5BB6;&#x5206;&#x4EAB;&#x3002;
</p>
<a id="more"></a>
<p>
Grady Booch&#x7684;&#x300A;UML&#x7528;&#x6237;&#x6307;&#x5357;&#x300B;&#xFF08;&#x4E2D;&#x6587;&#x7248;&#xFF09;&#x5C06;4+1&#x89C6;&#x56FE;&#x6A21;&#x578B;&#x63CF;&#x8FF0;&#x4E3A;&#xFF1A;
</p>


<div id="org19d76d0" class="figure">
<p><img src="model-system-architecture.png">
</p>
<p><span class="figure-number">Figure 1: </span>&#x5BF9;&#x7CFB;&#x7EDF;&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x5EFA;&#x6A21;</p>
</div>

<p>
&#x8F6F;&#x4EF6;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x4E0D;&#x4EC5;&#x5173;&#x5FC3;&#x7ED3;&#x6784;&#x548C;&#x884C;&#x4E3A;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x5173;&#x5FC3;&#x7528;&#x6CD5;&#x3001;&#x529F;&#x80FD;&#x3001;&#x6027;&#x80FD;&#x3001;&#x5F39;&#x6027;&#x3001;&#x590D;&#x7528;&#x3001;&#x53EF;&#x7406;&#x89E3;&#x6027;&#x3001;&#x7ECF;&#x6D4E;&#x4E0E;&#x6280;&#x672F;&#x7EA6;&#x675F;&#x53CA;&#x5176;&#x6298;&#x4E2D;&#xFF0C;&#x4EE5;&#x53CA;&#x5BA1;&#x7F8E;&#x7684;&#x8003;&#x8651;&#x3002;
</p>

<p>
&#x6700;&#x597D;&#x7528;5&#x4E2A;&#x4E92;&#x8054;&#x7684;&#x89C6;&#x56FE;&#x6765;&#x63CF;&#x8FF0;&#x8F6F;&#x4EF6;&#x5BC6;&#x96C6;&#x578B;&#x7CFB;&#x7EDF;&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;&#x89C6;&#x56FE;&#x5728;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x65B9;&#x9762;&#x5BF9;&#x7CFB;&#x7EDF;&#x7684;&#x7EC4;&#x7EC7;&#x548C;&#x7ED3;&#x6784;&#x8FDB;&#x884C;&#x7684;&#x6295;&#x5F71;&#x3002;
</p>

<p>
&#x7CFB;&#x7EDF;&#x7684;&#x7528;&#x4F8B;&#x89C6;&#x56FE;&#xFF08;use case view&#xFF09;&#x7531;&#x63CF;&#x8FF0;&#x53EF;&#x88AB;&#x6700;&#x7EC8;&#x7528;&#x6237;&#x3001;&#x5206;&#x6790;&#x4EBA;&#x5458;&#x548C;&#x6D4B;&#x8BD5;&#x4EBA;&#x5458;&#x770B;&#x5230;&#x7684;&#x7CFB;&#x7EDF;&#x884C;&#x4E3A;&#x7684;&#x7528;&#x4F8B;&#x7EC4;&#x6210;&#x3002;&#x7528;&#x4F8B;&#x89C6;&#x5B9E;&#x9645;&#x4E0A;&#x6CA1;&#x6709;&#x63CF;&#x8FF0;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x7EC4;&#x7EC7;&#xFF0C;&#x800C;&#x662F;&#x63CF;&#x8FF0;&#x4E86;&#x884C;&#x6210;&#x7CFB;&#x7EDF;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x7684;&#x52A8;&#x529B;&#x3002;
&#x5728;UML&#x4E2D;&#xFF0C;&#x8BE5;&#x89C6;&#x56FE;&#x7684; <b>&#x9759;&#x6001;</b> &#x65B9;&#x9762;&#x6709;&#x7528;&#x4F8B;&#x56FE;&#x8868;&#x73B0;&#xFF1B; <b>&#x52A8;&#x6001;</b> &#x65B9;&#x9762;&#x7531;&#x4EA4;&#x4E92;&#x56FE;&#x3001;&#x72B6;&#x6001;&#x56FE;&#x548C;&#x6D3B;&#x52A8;&#x56FE;&#x8868;&#x73B0;&#x3002;
</p>

<p>
&#x7CFB;&#x7EDF;&#x7684;&#x8BBE;&#x8BA1;&#x89C6;&#x56FE;&#xFF08;design view&#xFF09;&#x5305;&#x542B;&#x4E86;&#x7C7B;&#x3001;&#x63A5;&#x53E3;&#x548C;&#x534F;&#x4F5C;&#xFF0C;&#x4ED6;&#x4EEC;&#x5F62;&#x6210;&#x4E86;&#x95EE;&#x9898;&#x53CA;&#x5176;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x8BCD;&#x6C47;&#x3002;&#x8FD9;&#x79CD;&#x89C6;&#x56FE;&#x4E3B;&#x8981;&#x652F;&#x6301;&#x7CFB;&#x7EDF;&#x7684; <b>&#x529F;&#x80FD;&#x9700;&#x6C42;</b> &#xFF0C;&#x5373;&#x7CFB;&#x7EDF;&#x5E94;&#x8BE5;&#x63D0;&#x4F9B;&#x7ED9;&#x6700;&#x7EC8;&#x7528;&#x6237;&#x7684;&#x670D;&#x52A1;&#x3002;
&#x5728;UML&#x4E2D;&#xFF0C;&#x8BE5;&#x89C6;&#x56FE;&#x7684; <b>&#x9759;&#x6001;</b> &#x65B9;&#x9762;&#x7531;&#x7C7B;&#x56FE;&#x548C;&#x5BF9;&#x8C61;&#x56FE;&#x8868;&#x73B0;&#xFF1B; <b>&#x52A8;&#x6001;</b> &#x65B9;&#x9762;&#x7531;&#x4EA4;&#x4E92;&#x56FE;&#x3001;&#x72B6;&#x6001;&#x56FE;&#x548C;&#x6D3B;&#x52A8;&#x56FE;&#x8868;&#x73B0;&#x3002; <b>&#x7C7B;&#x7684;&#x5185;&#x90E8;&#x7ED3;&#x6784;&#x56FE;</b> &#x7279;&#x522B;&#x6709;&#x7528;&#x3002;
</p>

<blockquote>
<p>
<b>&#x7C7B;&#x7684;&#x5185;&#x90E8;&#x7ED3;&#x6784;&#x56FE;</b> &#xFF0C;&#x8FD9;&#x4E2A;&#x518D;&#x4ECB;&#x7ECD;&#x7EC4;&#x4EF6;&#x56FE;&#x7684;&#x65F6;&#x5019;&#x63D0;&#x5230;&#x8FC7;&#xFF0C;&#x7C7B;&#x56FE;&#x53EA;&#x80FD;&#x63CF;&#x8FF0;&#x5176;&#x5C5E;&#x6027;&#x548C;&#x64CD;&#x4F5C;&#xFF0C;&#x800C;&#x7C7B;&#x7684;&#x5185;&#x90E8;&#x7ED3;&#x6784;&#x56FE;&#x5219;&#x53EF;&#x4EE5;&#x63CF;&#x8FF0;&#x5185;&#x90E8;&#x6210;&#x5458;&#x7684;&#x7ED3;&#x6784;&#x3002;
</p>
</blockquote>

<p>
&#x7CFB;&#x7EDF;&#x7684;&#x4EA4;&#x4E92;&#x89C6;&#x56FE;&#xFF08;interaction view&#xFF09;&#x5C55;&#x793A;&#x4E86;&#x7CFB;&#x7EDF;&#x7684;&#x4E0D;&#x540C;&#x90E8;&#x5206;&#x4E4B;&#x95F4;&#x7684;&#x63A7;&#x5236;&#x6D41;&#xFF0C;&#x5305;&#x62EC;&#x53EF;&#x80FD;&#x7684;&#x5E76;&#x53D1;&#x548C;&#x540C;&#x6B65;&#x673A;&#x5236;&#x3002;&#x8BE5;&#x89C6;&#x56FE;&#x4E3B;&#x8981;&#x9488;&#x5BF9;&#x6027;&#x80FD;&#x3001;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x548C;&#x7CFB;&#x7EDF;&#x7684;&#x541E;&#x5410;&#x91CF;&#x3002;
&#x5728;UML&#x4E2D;&#xFF0C;&#x5BF9;&#x8BE5;&#x89C6;&#x56FE;&#x7684;&#x9759;&#x6001;&#x65B9;&#x9762;&#x548C;&#x52A8;&#x6001;&#x65B9;&#x9762;&#x7684;&#x8868;&#x73B0;&#x548C;&#x8BBE;&#x8BA1;&#x89C6;&#x56FE;&#x76F8;&#x540C;&#xFF0C;&#x4F46;&#x7740;&#x91CD;&#x4E8E;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#x7684;&#x7684;&#x4E3B;&#x52A8;&#x7C7B;&#x548C;&#x5728;&#x4ED6;&#x4EEC;&#x4E4B;&#x95F4;&#x6D41;&#x52A8;&#x7684;&#x6D88;&#x606F;&#x3002;
</p>

<p>
&#x7CFB;&#x7EDF;&#x7684;&#x5B9E;&#x73B0;&#x89C6;&#x56FE;&#xFF08;implement view&#xFF09;&#x5305;&#x542B;&#x4E86;&#x7528;&#x4E8E;&#x88C5;&#x914D;&#x4E0E;&#x53D1;&#x5E03;&#x7269;&#x7406;&#x7CFB;&#x7EDF;&#x7684;&#x5236;&#x54C1;&#x3002;&#x8FD9;&#x79CD;&#x89C6;&#x56FE;&#x4E3B;&#x8981;&#x9488;&#x5BF9;&#x7CFB;&#x7EDF;&#x53D1;&#x5E03;&#x7684;&#x914D;&#x7F6E;&#x7BA1;&#x7406;&#xFF0C;&#x5B83;&#x7531;&#x4E00;&#x4E9B;&#x72EC;&#x7ACB;&#x7684;&#x6587;&#x4EF6;&#x7EC4;&#x6210;&#xFF1B;&#x8FD9;&#x4E9B;&#x6587;&#x4EF6;&#x53EF;&#x4EE5;&#x7528;&#x5404;&#x79CD;&#x65B9;&#x6CD5;&#x88C5;&#x914D;&#xFF0C;&#x4EE5;&#x4EA7;&#x751F;&#x8FD0;&#x884C;&#x7CFB;&#x7EDF;&#x3002;
&#x5B83;&#x4E5F;&#x5173;&#x6CE8;&#x4ECE;&#x903B;&#x8F91;&#x7684;&#x7C7B;&#x548C;&#x7EC4;&#x4EF6;&#xFF08;component&#xFF09;&#x5230;&#x7269;&#x7406;&#x5236;&#x54C1;&#xFF08;artifact&#xFF09;&#x7684;&#x6620;&#x5C04;&#x3002;&#x5728;UML&#x4E2D;&#xFF0C;&#x8BE5;&#x89C6;&#x56FE;&#x7684;&#x9759;&#x6001;&#x65B9;&#x9762;&#x7531;&#x7EC4;&#x4EF6;&#x56FE;&#x8868;&#x73B0;&#xFF0C;&#x52A8;&#x6001;&#x56FE;&#x7531;&#x4EA4;&#x4E92;&#x56FE;&#x3001;&#x72B6;&#x6001;&#x56FE;&#x548C;&#x6D3B;&#x52A8;&#x56FE;&#x8868;&#x73B0;&#x3002;
</p>

<p>
&#x7CFB;&#x7EDF;&#x7684;&#x90E8;&#x7F72;&#x56FE;&#xFF08;deployment view&#xFF09;&#x5305;&#x542B;&#x4E86;&#x5F62;&#x6210;&#x7CFB;&#x7EDF;&#x786C;&#x4EF6;&#x62D3;&#x6251;&#x7ED3;&#x6784;&#x7684;&#x8282;&#x70B9;&#xFF08;&#x7CFB;&#x7EDF;&#x5728;&#x5176;&#x4E4B;&#x4E0A;&#x8FD0;&#x884C;&#xFF09;&#x3002;&#x8FD9;&#x79CD;&#x89C6;&#x56FE;&#x4E3B;&#x8981;&#x63CF;&#x8FF0;&#x7EC4;&#x6210;&#x7269;&#x7406;&#x7CFB;&#x7EDF;&#x7684;&#x90E8;&#x4EF6;&#xFF08;part&#xFF09;&#x7684;&#x5206;&#x5E03;&#x3001;&#x4EA4;&#x4ED8;&#x548C;&#x5B89;&#x88C5;&#x3002;
&#x5728;UML&#x4E2D;&#xFF0C;&#x8BE5;&#x89C6;&#x56FE;&#x7684;&#x9759;&#x6001;&#x65B9;&#x9762;&#x7531;&#x90E8;&#x7F72;&#x56FE;&#x8868;&#x73B0;&#xFF0C;&#x52A8;&#x6001;&#x56FE;&#x7531;&#x4EA4;&#x4E92;&#x56FE;&#x3001;&#x72B6;&#x6001;&#x56FE;&#x548C;&#x6D3B;&#x52A8;&#x56FE;&#x8868;&#x73B0;&#x3002;
</p>

<p>
&#x8FD9;5&#x79CD;&#x89C6;&#x56FE;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x79CD;&#x90FD;&#x53EF;&#x5355;&#x72EC;&#x4F7F;&#x7528;&#xFF0C;&#x4F7F;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#x5458;&#x80FD;&#x4E13;&#x6CE8;&#x4E8E;&#x4ED6;&#x4EEC;&#x6700;&#x4E3A;&#x5173;&#x5FC3;&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x4E94;&#x79CD;&#x89C6;&#x56FE;&#x4E5F;&#x4F1A;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#xFF0C;&#x5982;&#x90E8;&#x7F72;&#x89C6;&#x56FE;&#x4E2D;&#x7684;&#x8282;&#x70B9;&#x62E5;&#x6709;&#x5B9E;&#x73B0;&#x89C6;&#x56FE;&#x7684;&#x7EC4;&#x4EF6;&#xFF0C;
&#x800C;&#x8FD9;&#x4E9B;&#x7EC4;&#x4EF6;&#x53C8;&#x8868;&#x793A;&#x4E86;&#x8BBE;&#x8BA1;&#x89C6;&#x56FE;&#x548C;&#x4EA4;&#x4E92;&#x89C6;&#x56FE;&#x4E2D;&#x7684;&#x7C7B;&#x3001;&#x63A5;&#x53E3;&#x3001;&#x534F;&#x4F5C;&#x4EE5;&#x53CA;&#x4E3B;&#x52A8;&#x7C7B;&#x7684;&#x7269;&#x7406;&#x5B9E;&#x73B0;&#x3002;UML&#x5141;&#x8BB8;&#x8868;&#x8FBE;&#x8FD9;&#x4E94;&#x79CD;&#x89C6;&#x56FE;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x4E00;&#x79CD;&#x3002;
</p>

<blockquote>
<p>
&#x4EE5;&#x4E0A;&#x5185;&#x5BB9;&#x6458;&#x81EA;&#x300A;UML&#x7528;&#x6237;&#x6307;&#x5357;&#x300B;&#xFF0C;&#x6700;&#x540E;&#x4E00;&#x6BB5;&#x8BDD;&#x4E2D;&#xFF0C;&#x4F5C;&#x8005;&#x8BF4;&#x90E8;&#x7F72;&#x89C6;&#x56FE;&#x4E2D;&#x7684;&#x8282;&#x70B9;&#x62E5;&#x6709;&#x5B9E;&#x73B0;&#x89C6;&#x56FE;&#x7684;&#x7EC4;&#x4EF6;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x5176;&#x4ED6;&#x5730;&#x65B9;&#x6709;&#x7684;&#x8BF4;&#x8FD9;&#x4E9B;&#x8282;&#x70B9;&#x62E5;&#x6709;&#x5236;&#x54C1;&#xFF08;artifact&#xFF09;&#x3002;
&#x6216;&#x8BB8;&#x8FD9;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#x90FD;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#x3002;&#x56E0;&#x4E3A;UML&#x672C;&#x8EAB;&#x4F7F;&#x7528;&#x5C31;&#x5F88;&#x7075;&#x6D3B;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x6309;&#x7167;&#x6211;&#x7684;&#x7406;&#x89E3;&#x8282;&#x70B9;&#x5E94;&#x8BE5;&#x662F;&#x5305;&#x542B;&#x5236;&#x54C1;&#xFF0C;&#x5236;&#x54C1;&#x56FE;&#x7528;&#x4E8E;&#x63CF;&#x8FF0;&#x5176;&#x548C;&#x7C7B;&#x4E0E;&#x7EC4;&#x4EF6;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3002;
</p>
</blockquote>

<p>
&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#x6458;&#x81EA;stack exchange&#xFF1A;
</p>

<p>
Th advantage of the 4+1 View Model is that it maps stakeholders to the type of information that they need, without requiring specific modeling notations to be used. The emphasis is on ensuring that all groups have the information to understand the system and continue to do their job.
</p>

<p>
The 4+1 View Model of Software Architecture was described in Philippe Kruchten&apos;s paper Architectural Blueprints - The &quot;4+1&quot; View Model of Software Architeture that was originally published in IEEE Software (November 1995). This publication doesn&apos;t make specific references to UML. In fact, the paper uses the Booch notation for the logical view, extensions to the Booch notation for process view and development view, calls out the use of &quot;several forms&quot; of developing a physical view, and a new notation for scenarios.
</p>

<p>
Instead of trying to map each of the views to particular types of diagrams, consider who the target audience of each view is and what information they need. Knowing that, look at various types of models and which one(s) provide the required information.
</p>

<p>
The logical view is designed to address the end user&apos;s concerns about ensuring that all of their desired functionality is captured by the system. In an object-oriented system, this is often at the class level. In complex systems, you may need a package view and decompose the packages into multiple class diagrams. In other paradigms, you may be interested in representing modules and the functions they provide. The end result should be a mapping of the required functionality to components that provide that functionality.
</p>

<p>
The process view is designed for people designing the whole system and then integrating the subsystems or the system into a system of systems. This view shows tasks and processes that the system has, interfaces to the outside world and/or between components within the system, the messages sent and received, and how performance, availability, fault-tolerance, and integrity are being addressed.
</p>

<p>
The development view is primarily for developers who will be building the modules and the subsystems. It should show dependencies and relationships between modules, how modules are organized, reuse, and portability.
</p>

<p>
The physical view is primarily for system designers and administrators who need to understand the physical locations of the software, physical connections between nodes, deployment and installation, and scalability.
</p>

<p>
Finally, the scenarios help to capture the requirements so that all the stakeholders understand how the system is intended to be used.
</p>

<p>
Once you understand what each view is supposed to provide, you can choose what modeling notations to use and at what level of detail is required. Bart&apos;s last paragraph is especially true - you can show various levels of details in your UML models by focusing on particular design elements or combining various types of diagrams into a set. In addition, you may want to consider going beyond UML to other modeling notations to better describe your system architecture - SysML, Entity-Relation modeling, or IDEF.
</p>

<blockquote>
<p>
&#x7B54;&#x4E3B;&#x4ECE;&#x4F7F;&#x7528;&#x8005;&#x7684;&#x89D2;&#x5EA6;&#x9610;&#x91CA;&#x4E86;&#x5404;&#x79CD;&#x89C6;&#x56FE;&#x7684;&#x7528;&#x9014;&#x3002;&#x6839;&#x636E;&#x9700;&#x6C42;&#x9009;&#x62E9;&#x5408;&#x9002;&#x7684;&#x89C6;&#x56FE;&#x53BB;&#x63CF;&#x8FF0;&#x7CFB;&#x7EDF;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x3002;&#x6240;&#x4EE5;&#x89C6;&#x56FE;&#x548C;UML&#x5404;&#x79CD;&#x56FE;&#x4E4B;&#x95F4;&#x6CA1;&#x6709;&#x5341;&#x5206;&#x660E;&#x786E;&#x7684;&#x6620;&#x5C04;&#x5173;&#x7CFB;&#x3002;
</p>
</blockquote>

<p>
<b>&#x53C2;&#x8003;&#x8D44;&#x6599;</b>
</p>
<ol class="org-ol">
<li>UML&#x7528;&#x6237;&#x6307;&#x5357; / Grady Booch / &#x4EBA;&#x6C11;&#x90AE;&#x7535;&#x51FA;&#x7248;&#x793E;</li>
<li><a href="https://softwareengineering.stackexchange.com/questions/233257/mapping-between-41-architectural-view-model-uml" target="_blank" rel="external">Mapping between 4+1 architectural view model &amp; UML</a></li>
</ol>
</div>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/UML/" rel="tag"># UML</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2017/12/01/spike-plantuml-deployment-diagram/" rel="next" title="[PlantUML实践]部署图">
                <i class="fa fa-chevron-left"></i> [PlantUML实践]部署图
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2017/12/10/difference-between-class-and-component/" rel="prev" title="类和组件之间的区别">
                类和组件之间的区别 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      

      <section class="site-overview sidebar-panel sidebar-panel-active">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/avatar.jpg"
               alt="Jack Gao" />
          <p class="site-author-name" itemprop="name">Jack Gao</p>
           
              <p class="site-description motion-element" itemprop="description">Jack Gao's Blog</p>
          
        </div>
        <nav class="site-state motion-element">

          
            <div class="site-state-item site-state-posts">
              <a href="/archives/">
                <span class="site-state-item-count">23</span>
                <span class="site-state-item-name">posts</span>
              </a>
            </div>
          

          
            
            
            <div class="site-state-item site-state-categories">
              <a href="/categories/index.html">
                <span class="site-state-item-count">19</span>
                <span class="site-state-item-name">categories</span>
              </a>
            </div>
          

          
            
            
            <div class="site-state-item site-state-tags">
              <a href="/tags/index.html">
                <span class="site-state-item-count">35</span>
                <span class="site-state-item-name">tags</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

        


      </section>

      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy;  2017 - 
  <span itemprop="copyrightYear">2018</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Jack Gao</span>
</div>


<div class="powered-by">
  Powered by <a class="theme-link" href="https://hexo.io">Hexo</a>
</div>

<div class="theme-info">
  Theme -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Mist
  </a>
</div>


        

        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
      </div>
    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  












  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.1"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.1"></script><!-- hexo-inject:begin --><!-- Begin: Injected MathJax -->
<script type="text/x-mathjax-config">
  MathJax.Hub.Config({"tex2jax":{"inlineMath":[["$","$"],["\\(","\\)"]],"skipTags":["script","noscript","style","textarea","pre","code"],"processEscapes":true},"TeX":{"equationNumbers":{"autoNumber":"AMS"}}});
</script>

<script type="text/x-mathjax-config">
  MathJax.Hub.Queue(function() {
    var all = MathJax.Hub.getAllJax(), i;
    for(i=0; i < all.length; i += 1) {
      all[i].SourceElement().parentNode.className += ' has-jax';
    }
  });
</script>

<script type="text/javascript" src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML">
</script>
<!-- End: Injected MathJax -->
<!-- hexo-inject:end -->



  


  




	





  





  





  






  





  

  

  

  

  

  

</body>
</html>
