<!doctype html>



  


<html class="theme-next mist use-motion" lang="en">
<head>
  <!-- hexo-inject:begin --><!-- hexo-inject:end --><meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>









<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />















  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="UML," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.1.1" />






<meta name="description" content="&amp;#x56DE;&amp;#x5934;&amp;#x53C8;&amp;#x770B;&amp;#x4E86;&amp;#x770B; &amp;#x7B2C;&amp;#x4E00;&amp;#x7AE0; &amp;#x4E3A;&amp;#x4EC0;&amp;#x4E48;&amp;#x8981;&amp;#x5EFA;&amp;#x6A21; &amp;#xFF0C;&amp;#x53D1;&amp;#x73B0;&amp;#x8FD8;&amp;#x662F;&amp;#x6709;&amp;#x4E9B;&amp;#x503C;&amp;#x5F97;&amp;#x">
<meta name="keywords" content="UML">
<meta property="og:type" content="article">
<meta property="og:title" content="[UML笔记] 为什么要建模">
<meta property="og:url" content="jack2gs.github.io/2017/12/31/uml-note-why-model/index.html">
<meta property="og:site_name" content="Jack Gao&#39;s Blog">
<meta property="og:description" content="&amp;#x56DE;&amp;#x5934;&amp;#x53C8;&amp;#x770B;&amp;#x4E86;&amp;#x770B; &amp;#x7B2C;&amp;#x4E00;&amp;#x7AE0; &amp;#x4E3A;&amp;#x4EC0;&amp;#x4E48;&amp;#x8981;&amp;#x5EFA;&amp;#x6A21; &amp;#xFF0C;&amp;#x53D1;&amp;#x73B0;&amp;#x8FD8;&amp;#x662F;&amp;#x6709;&amp;#x4E9B;&amp;#x503C;&amp;#x5F97;&amp;#x">
<meta property="og:updated_time" content="2018-01-03T14:56:21.053Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="[UML笔记] 为什么要建模">
<meta name="twitter:description" content="&amp;#x56DE;&amp;#x5934;&amp;#x53C8;&amp;#x770B;&amp;#x4E86;&amp;#x770B; &amp;#x7B2C;&amp;#x4E00;&amp;#x7AE0; &amp;#x4E3A;&amp;#x4EC0;&amp;#x4E48;&amp;#x8981;&amp;#x5EFA;&amp;#x6A21; &amp;#xFF0C;&amp;#x53D1;&amp;#x73B0;&amp;#x8FD8;&amp;#x662F;&amp;#x6709;&amp;#x4E9B;&amp;#x503C;&amp;#x5F97;&amp;#x">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Mist',
    sidebar: {"position":"left","display":"post","offset":12,"offset_float":0,"b2t":false,"scrollpercent":false},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '0',
      author: 'Author'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="jack2gs.github.io/2017/12/31/uml-note-why-model/"/>






  <title>[UML笔记] 为什么要建模 | Jack Gao's Blog</title><!-- hexo-inject:begin --><!-- hexo-inject:end -->
  














</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="en">

  
  
    
  

  <!-- hexo-inject:begin --><!-- hexo-inject:end --><div class="container sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/"  class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">Jack Gao's Blog</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">Road & Book</p>
      
  </div>

  <div class="site-nav-toggle">
    <button>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            Home
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            Categories
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            About
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            Archives
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            Tags
          </a>
        </li>
      

      
    </ul>
  

  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
    <link itemprop="mainEntityOfPage" href="jack2gs.github.io/2017/12/31/uml-note-why-model/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="Jack Gao">
      <meta itemprop="description" content="">
      <meta itemprop="image" content="/images/avatar.jpg">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="Jack Gao's Blog">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">[UML笔记] 为什么要建模</h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">Posted on</span>
              
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2017-12-31T19:48:29+08:00">
                2017-12-31
              </time>
            

            
              <span class="post-meta-divider">|</span>
            

            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-check-o"></i>
              </span>
              
                <span class="post-meta-item-text">Post modified</span>
              
              <time title="Post modified" itemprop="dateModified" datetime="2018-01-03T22:56:21+08:00">
                2018-01-03
              </time>
            
          </span>

          
            <span class="post-category" >
            
              <span class="post-meta-divider">|</span>
            
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              
                <span class="post-meta-item-text">In</span>
              
              
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/categories/UML/" itemprop="url" rel="index">
                    <span itemprop="name">UML</span>
                  </a>
                </span>

                
                
              
            </span>
          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    <div class="post-body" itemprop="articleBody">

      
      

      
        <div id="content">
<p>
&#x56DE;&#x5934;&#x53C8;&#x770B;&#x4E86;&#x770B; <b>&#x7B2C;&#x4E00;&#x7AE0; &#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5EFA;&#x6A21;</b> &#xFF0C;&#x53D1;&#x73B0;&#x8FD8;&#x662F;&#x6709;&#x4E9B;&#x503C;&#x5F97;&#x6574;&#x7406;&#x7684;&#x5730;&#x65B9;&#x3002;&#x6E29;&#x6545;&#x800C;&#x77E5;&#x65B0;&#xFF0C;&#x6BCF;&#x6B21;&#x9605;&#x8BFB;&#x90FD;&#x4F1A;&#x6709;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x4F53;&#x4F1A;&#x3002;
</p>
<a id="more"></a>

<p>
&#x672C;&#x7AE0;&#x5185;&#x5BB9;&#xFF1A;&#x5EFA;&#x6A21;&#x7684;&#x91CD;&#x8981;&#x6027;&#xFF1B;&#x5EFA;&#x6A21;&#x7684;&#x56DB;&#x9879;&#x539F;&#x7406;&#xFF1B;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x57FA;&#x672C;&#x84DD;&#x56FE;&#xFF1B;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x5EFA;&#x6A21;&#x3002;
</p>
<div id="outline-container-org1e21602" class="outline-2">
<h2 id="org1e21602"><span class="section-number-2">1</span> &#x5F15;&#x8A00;</h2>
<div class="outline-text-2" id="text-1">
<blockquote>
<p>
&#x5EFA;&#x6A21;&#x662F;&#x5F00;&#x53D1;&#x4F18;&#x79C0;&#x8F6F;&#x4EF6;&#x7684;&#x6240;&#x6709;&#x6D3B;&#x52A8;&#x4E2D;&#x7684;&#x6838;&#x5FC3;&#x90E8;&#x5206;&#xFF0C;&#x5176;&#x76EE;&#x7684;&#x662F;&#x4E3A;&#x4E86;&#x628A;&#x60F3;&#x8981;&#x5F97;&#x5230;&#x7684;&#x7CFB;&#x7EDF;&#x7ED3;&#x6784;&#x548C;&#x884C;&#x4E3A;&#x6C9F;&#x901A;&#x8D77;&#x6765;&#xFF0C;&#x4E3A;&#x4E86;&#x5BF9;&#x7CFB;&#x7EDF;&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x8FDB;&#x884C;&#x53EF;&#x89C6;&#x5316;&#x548C;&#x63A7;&#x5236;&#xFF0C;&#x4E3A;&#x4E86;&#x66F4;&#x597D;&#x5730;&#x7406;&#x89E3;&#x6B63;&#x5728;&#x6784;&#x9020;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x5E76;&#x7ECF;&#x5E38;&#x63ED;&#x793A;&#x7B80;&#x5316;&#x548C;&#x590D;&#x7528;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x662F;&#x4E3A;&#x4E86;&#x7BA1;&#x7406;&#x98CE;&#x9669;&#x3002; 
</p>
</blockquote>
<p>
&#x51E0;&#x4E2A; <b>&#x4E3A;&#x4E86;</b> &#x7B80;&#x5355;&#x63ED;&#x793A;&#x4E86;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x8FDB;&#x884C;&#x5EFA;&#x6A21;&#x3002;
</p>
</div>
</div>
<div id="outline-container-org1a5b680" class="outline-2">
<h2 id="org1a5b680"><span class="section-number-2">2</span> &#x5EFA;&#x6A21;&#x7684;&#x91CD;&#x8981;&#x6027;</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgd5f4883" class="outline-3">
<h3 id="orgd5f4883"><span class="section-number-3">2.1</span> &#x6A21;&#x578B;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</h3>
<div class="outline-text-3" id="text-2-1">
<blockquote>
<p>
&#x7B80;&#x5355;&#x5730;&#x8BF4;&#xFF1A;&#x6A21;&#x578B;&#x662F;&#x5BF9;&#x73B0;&#x5B9E;&#x7684;&#x7B80;&#x5316;&#x3002;
</p>

<p>
&#x6A21;&#x578B;&#x63D0;&#x4F9B;&#x4E86;&#x7CFB;&#x7EDF;&#x7684;&#x84DD;&#x56FE;&#x3002;&#x6A21;&#x578B;&#x65E2;&#x53EF;&#x4EE5;&#x5305;&#x62EC;&#x8BE6;&#x7EC6;&#x7684;&#x8BA1;&#x5212;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5305;&#x62EC;&#x4ECE;&#x5F88;&#x9AD8;&#x7684;&#x5C42;&#x6B21;&#x8003;&#x8651;&#x7CFB;&#x7EDF;&#x7684;&#x603B;&#x4F53;&#x8BA1;&#x5212;&#x3002;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x6A21;&#x578B;&#x5305;&#x62EC;&#x90A3;&#x4E9B;&#x6709;&#x5E7F;&#x6CDB;&#x5F71;&#x54CD;&#x7684;&#x4E3B;&#x8981;&#x5143;&#x7D20;&#xFF0C;&#x800C;&#x5FFD;&#x7565;&#x90A3;&#x4E9B;&#x4E0E;&#x7ED9;&#x5B9A;&#x7684;&#x62BD;&#x8C61;&#x6C34;&#x5E73;&#x4E0D;&#x76F8;&#x5173;&#x7684;&#x6B21;&#x8981;&#x5143;&#x7D20;&#x3002;&#x6BCF;&#x4E2A;&#x7CFB;&#x7EDF;&#x90FD;&#x53EF;&#x4EE5;&#x4ECE;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x9762;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x6A21;&#x578B;&#x6765;&#x63CF;&#x8FF0;&#xFF0C;&#x56E0;&#x800C;&#x6BCF;&#x4E2A;&#x6A21;&#x578B;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x5728;&#x8BED;&#x4E49;&#x4E0A;&#x3002;
</p>
</blockquote>
<p>
&#x62BD;&#x8C61;&#x4E0E;&#x89C2;&#x5BDF;&#x8005;&#x7684;&#x89C6;&#x89D2;&#x6709;&#x5173;&#x3002;&#x4ECE;&#x7CFB;&#x7EDF;&#x9700;&#x6C42;&#x5206;&#x6790;&#x5230;&#x5B8C;&#x6210;&#x90E8;&#x7F72;&#xFF0C;&#x671F;&#x95F4;&#x6709;&#x5F88;&#x591A;&#x5229;&#x76CA;&#x76F8;&#x5173;&#x8005;&#x3002;&#x6240;&#x4EE5;&#x4E0D;&#x80FD;&#x53EA;&#x7528;&#x4E00;&#x79CD;&#x62BD;&#x8C61;&#x5C42;&#x6B21;&#x7684;&#x6A21;&#x578B;&#x6765;&#x63CF;&#x8FF0;&#x7CFB;&#x7EDF;&#x3002;
</p>
</div>
</div>
<div id="outline-container-org9563b05" class="outline-3">
<h3 id="org9563b05"><span class="section-number-3">2.2</span> &#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5EFA;&#x6A21;</h3>
<div class="outline-text-3" id="text-2-2">
<blockquote>
<p>
&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x7406;&#x7531;&#x662F;&#xFF1A;&#x5EFA;&#x6A21;&#x662F;&#x4E3A;&#x4E86;&#x80FD;&#x591F;&#x66F4;&#x597D;&#x5730;&#x7406;&#x89E3;&#x6B63;&#x5728;&#x5F00;&#x53D1;&#x7684;&#x7CFB;&#x7EDF;&#x3002;
</p>

<p>
&#x901A;&#x8FC7;&#x5EFA;&#x6A21;&#xFF0C;&#x8981;&#x8FBE;&#x5230;&#x4EE5;&#x4E0B;4&#x4E2A;&#x76EE;&#x7684;&#x3002;
</p>
<ol class="org-ol">
<li>&#x6A21;&#x578B;&#x6709;&#x52A9;&#x4E8E;&#x6309;&#x7167;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#x6216;&#x6309;&#x7167;&#x6240;&#x9700;&#x8981;&#x7684;&#x6837;&#x5F0F;&#x5BF9;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x53EF;&#x89C6;&#x5316;&#x3002;</li>
<li>&#x6A21;&#x578B;&#x80FD;&#x591F;&#x89C4;&#x7EA6;&#x7CFB;&#x7EDF;&#x7684;&#x7ED3;&#x6784;&#x548C;&#x884C;&#x4E3A;&#x3002;</li>
<li>&#x6A21;&#x578B;&#x7ED9;&#x51FA;&#x4E86;&#x77E5;&#x9053;&#x6784;&#x9020;&#x7CFB;&#x7EDF;&#x7684;&#x6A21;&#x677F;&#x3002;</li>
<li>&#x6A21;&#x578B;&#x5BF9;&#x505A;&#x51FA;&#x7684;&#x51B3;&#x7B56;&#x8FDB;&#x884C;&#x6587;&#x6863;&#x5316;&#x3002;</li>
</ol>
</blockquote>
<p>
&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x4E9B;&#x63AA;&#x8F9E;&#x6BD4;&#x8F83;&#x5B66;&#x672F;&#x5316;&#x3002;&#x8FD8;&#x662F;&#x4E0B;&#x8FF0;&#x6BD4;&#x8F83;&#x63A5;&#x5730;&#x6C14;&#x3002;
</p>
<blockquote>
<p>
&#x5EFA;&#x6A21;&#x5E76;&#x4E0D;&#x53EA;&#x662F;&#x9488;&#x5BF9;&#x8F83;&#x5927;&#x7684;&#x7CFB;&#x7EDF;&#x3002;&#x751A;&#x81F3;&#x50CF;&#x72D7;&#x7A9D;&#x90A3;&#x6837;&#x7684;&#x8F6F;&#x4EF6;&#x4E5F;&#x80FD;&#x4ECE;&#x4E00;&#x4E9B;&#x5EFA;&#x6A21;&#x4E2D;&#x6536;&#x76CA;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x53EF;&#x4EE5;&#x51C6;&#x786E;&#x5730;&#x8BB2;&#xFF0C;&#x7CFB;&#x7EDF;&#x8D8A;&#x5927;&#x3001;&#x8D8A;&#x590D;&#x6742;&#xFF0C;&#x5EFA;&#x6A21;&#x7684;&#x91CD;&#x8981;&#x6027;&#x5C31;&#x8D8A;&#x5927;&#xFF0C;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x539F;&#x56E0;&#x662F;&#xFF1A;
</p>

<p>
<b>&#x56E0;&#x4E3A;&#x4E0D;&#x80FD;&#x5B8C;&#x6574;&#x5730;&#x7406;&#x89E3;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x6240;&#x4EE5;&#x8981;&#x5BF9;&#x5B83;&#x5EFA;&#x6A21;&#x3002;</b>
</p>

<p>
&#x4EBA;&#x5BF9;&#x590D;&#x6742;&#x95EE;&#x9898;&#x7684;&#x7406;&#x89E3;&#x80FD;&#x529B;&#x662F;&#x6709;&#x9650;&#x7684;&#x3002;&#x901A;&#x8FC7;&#x5EFA;&#x6A21;&#xFF0C;&#x7F29;&#x5C0F;&#x6240;&#x7814;&#x7A76;&#x95EE;&#x9898;&#x7684;&#x8303;&#x56F4;&#xFF0C;&#x4E00;&#x6B21;&#x53EA;&#x7740;&#x91CD;&#x7814;&#x7A76;&#x5B83;&#x7684;&#x4E00;&#x4E2A;&#x65B9;&#x9762;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;Edsger Dijkstra&#x51E0;&#x5E74;&#x524D;&#x6240;&#x8BB2;&#x7684;&#x201C;&#x5206;&#x800C;&#x6CBB;&#x4E4B;&#x201D;&#x7684;&#x57FA;&#x672C;&#x65B9;&#x6CD5;&#xFF0C;&#x5373;&#x628A;&#x4E00;&#x4E2A;&#x56F0;&#x96BE;&#x95EE;&#x9898;&#x5212;&#x5206;&#x6210;&#x4E00;&#x4E9B;&#x5217;&#x80FD;&#x591F;&#x89E3;&#x51B3;&#x7684;&#x5C0F;&#x95EE;&#x9898;&#xFF1B;&#x89E3;&#x51B3;&#x4E86;&#x8FD9;&#x4E9B;&#x5C0F;&#x95EE;&#x9898;&#x4E5F;&#x5C31;&#x89E3;&#x51B3;&#x4E86;&#x8FD9;&#x4E2A;&#x96BE;&#x9898;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x901A;&#x8FC7;&#x5EFA;&#x6A21;&#x53EF;&#x4EE5;&#x589E;&#x5F3A;&#x4EBA;&#x7684;&#x667A;&#x529B;&#x3002;&#x4E00;&#x4E2A;&#x9002;&#x5F53;&#x9009;&#x62E9;&#x7684;&#x6A21;&#x578B;&#x53EF;&#x4EE5;&#x4F7F;&#x5EFA;&#x6A21;&#x4EBA;&#x5458;&#x5728;&#x8F83;&#x9AD8;&#x7684;&#x62BD;&#x8C61;&#x5C42;&#x6B21;&#x4E0A;&#x5DE5;&#x4F5C;&#x3002;
</p>
</blockquote>
<p>
&#x7CFB;&#x7EDF;&#x662F;&#x590D;&#x6742;&#x7684;&#xFF0C;&#x800C;&#x4EBA;&#x5904;&#x7406;&#x590D;&#x6742;&#x95EE;&#x9898;&#x7684;&#x80FD;&#x529B;&#x662F;&#x6709;&#x9650;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x4EBA;&#x7C7B;&#x5FC5;&#x987B;&#x501F;&#x52A9;&#x4E8E;&#x5DE5;&#x5177;&#xFF0C;&#x501F;&#x52A9;&#x4E8E;&#x65B9;&#x6CD5;&#x8BBA;&#x6765;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x3002;&#x8BF4;&#x8D77;&#x6765;&#x4E5F;&#x7B80;&#x5355;&#xFF0C;&#x6700;&#x57FA;&#x672C;&#x5730;&#xFF0C;&#x5206;&#x89E3;&#x3001;&#x62BD;&#x8C61;&#x3001;&#x5206;&#x79BB;&#x5173;&#x6CE8;&#x7B49;&#x3002;&#x4E0E;&#x5206;&#x800C;&#x6CBB;&#x4E4B;&#x7684;&#x601D;&#x60F3;&#x662F;&#x76F8;&#x901A;&#x7684;&#x3002;
</p>
</div>
</div>
</div>
<div id="outline-container-orge73b89b" class="outline-2">
<h2 id="orge73b89b"><span class="section-number-2">3</span> &#x5EFA;&#x6A21;&#x539F;&#x7406;</h2>
<div class="outline-text-2" id="text-3">
<blockquote>
<p>
&#x7B2C;&#x4E00;&#xFF0C;&#x9009;&#x62E9;&#x8981;&#x521B;&#x5EFA;&#x4EC0;&#x4E48;&#x6A21;&#x578B;&#xFF0C;&#x5BF9;&#x5982;&#x4F55;&#x624B;&#x52A8;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x548C;&#x5982;&#x4F55;&#x5F62;&#x6210;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x6709;&#x7740;&#x610F;&#x4E49;&#x6DF1;&#x8FDC;&#x7684;&#x5F71;&#x54CD;&#x3002;
</p>

<p>
&#x5BF9;&#x4E8E;&#x8F6F;&#x4EF6;&#x800C;&#x8A00;&#xFF0C;&#x6240;&#x9009;&#x62E9;&#x7684;&#x6A21;&#x578B;&#x5C06;&#x5728;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x5F71;&#x54CD;&#x5EA6;&#x5BF9;&#x9886;&#x57DF;&#x7684;&#x770B;&#x6CD5;&#x3002;&#x5982;&#x679C;&#x4EE5; <b>&#x6570;&#x636E;&#x5F00;&#x53D1;&#x8005;</b> &#x7684;&#x89C6;&#x70B9;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x6CE8;&#x610F;&#x5B9E;&#x4F53;-&#x8054;&#x7CFB;&#x6A21;&#x578B;&#xFF0C;&#x8BE5;&#x6A21;&#x578B;&#x628A;&#x884C;&#x4E3A;&#x653E;&#x5165;&#x89E6;&#x53D1;&#x5668;&#x548C;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x4E2D;&#x3002;&#x5982;&#x679C;&#x4EE5;&#x7ED3;&#x6784;&#x5316;&#x5F00;&#x53D1;&#x8005;&#x7684;&#x8BD5;&#x70B9;&#x6784;&#x9020;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#xFF0C;&#x53EF;&#x80FD;&#x5F97;&#x5230;&#x4EE5;&#x7B97;&#x6CD5;&#x4E3A;&#x4E2D;&#x5FC3;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x542B;&#x4ECE;&#x5904;&#x7406;&#x5230;&#x5904;&#x7406;&#x7684;&#x6570;&#x636E;&#x6D41;&#x3002;&#x5982;&#x679C;&#x4EE5;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x5F00;&#x53D1;&#x8005;&#x7684;&#x89C2;&#x70B9;&#x6784;&#x9020;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#xFF0C;&#x5C06;&#x53EF;&#x80FD;&#x5F97;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#xFF1A;&#x5B83;&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x4EE5;&#x4E00;&#x7EC4;&#x7C7B;&#x548C;&#x4EA4;&#x4E92;&#x6A21;&#x5F0F;&#xFF08;&#x6307;&#x51FA;&#x8FD9;&#x4E9B;&#x7C7B;&#x5982;&#x4F55;&#x4E00;&#x8D77;&#x5DE5;&#x4F5C;&#xFF09;&#x4E3A;&#x4E2D;&#x5FC3;&#x3002;
</p>
</blockquote>
<p>
&#x5EFA;&#x6A21;&#x65B9;&#x6CD5;&#x6709;&#x5F88;&#x591A;&#x79CD;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x62BD;&#x8C61;&#x89C6;&#x89D2;&#x3002;&#x4E5F;&#x6709;&#x7740;&#x5404;&#x81EA;&#x7684;&#x4E00;&#x5957;&#x65B9;&#x6CD5;&#x8BBA;&#xFF0C;&#x5EFA;&#x6A21;&#x65B9;&#x6CD5;&#x4E5F;&#x4E0D;&#x540C;&#x3002;
</p>
<blockquote>
<p>
&#x7B2C;&#x4E8C;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x7CBE;&#x5EA6;&#x754C;&#x522B;&#x4E0A;&#x8868;&#x793A;&#x4E00;&#x79CD;&#x6A21;&#x578B;&#x3002;
</p>
</blockquote>
<p>
&#x524D;&#x9762;&#x63D0;&#x5230;&#xFF0C;&#x89E3;&#x51B3;&#x590D;&#x6742;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6700;&#x57FA;&#x672C;&#x7684;&#xFF1A;&#x5206;&#x89E3;&#xFF0C;&#x62BD;&#x8C61;&#xFF0C;&#x5206;&#x79BB;&#x5173;&#x6CE8;&#x3002;
</p>
<blockquote>
<p>
&#x6700;&#x597D;&#x7684;&#x6A21;&#x578B;&#x662F;&#x4E0E;&#x73B0;&#x5B9E;&#x76F8;&#x8054;&#x7CFB;&#x7684;&#x3002;
</p>
</blockquote>
<p>
&#x8FD9;&#x662F;&#x7CFB;&#x7EDF;&#x9690;&#x55BB;&#x7684;&#x53E6;&#x4E00;&#x79CD;&#x8BF4;&#x6CD5;&#x5427;&#x3002;&#x597D;&#x7684;&#x8BBE;&#x8BA1;&#x4F1A;&#x6709;&#x597D;&#x7684;&#x7CFB;&#x7EDF;&#x9690;&#x55BB;&#x3002;
</p>
<blockquote>
<p>
&#x7B2C;&#x56DB;&#xFF0C;&#x5355;&#x4E2A;&#x6A21;&#x578B;&#x6216;&#x89C6;&#x56FE;&#x662F;&#x4E0D;&#x5145;&#x5206;&#x7684;&#x3002;&#x5BF9;&#x6BCF;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x7CFB;&#x7EDF;&#x6700;&#x597D;&#x7528;&#x4E00;&#x7EC4;&#x51E0;&#x4E4E;&#x72EC;&#x7ACB;&#x7684;&#x6A21;&#x578B;&#x4ECE;&#x591A;&#x4E2A;&#x89C6;&#x89D2;&#x53BB;&#x903C;&#x8FD1;&#x3002;
</p>
</blockquote>
<p>
&#x8FD8;&#x662F;&#x90A3;&#x53E5;&#x8BDD;&#xFF0C;&#x7CFB;&#x7EDF;&#x662F;&#x590D;&#x6742;&#x7684;&#xFF0C;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6709;&#x7740;&#x4E0D;&#x540C;&#x89D2;&#x8272;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x3002;&#x6240;&#x4EE5;&#x9700;&#x8981;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x62BD;&#x8C61;&#x53BB;&#x63CF;&#x8FF0;&#x7CFB;&#x7EDF;&#x3002;
</p>
</div>
</div>
<div id="outline-container-orgbc00d50" class="outline-2">
<h2 id="orgbc00d50"><span class="section-number-2">4</span> &#x9762;&#x5411;&#x5BF9;&#x8C61;&#x5EFA;&#x6A21;</h2>
<div class="outline-text-2" id="text-4">
<blockquote>
<p>
&#x4F20;&#x7EDF;&#x7684;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x65B9;&#x6CD5;&#x662F;&#x4ECE;&#x7B97;&#x6CD5;&#x7684;&#x89D2;&#x5EA6;&#x8FDB;&#x884C;&#x5EFA;&#x6A21;&#x3002;&#x6309;&#x7167;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x8F6F;&#x4EF6;&#x90FD;&#x7528;&#x8FC7;&#x7A0B;&#x6216;&#x8005;&#x51FD;&#x6570;&#x4F5C;&#x4E3A;&#x4E3B;&#x8981;&#x6784;&#x9020;&#x5757;&#x3002;&#x8FD9;&#x79CD;&#x89C2;&#x70B9;&#x5BFC;&#x81F4;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x628A;&#x7CBE;&#x529B;&#x96C6;&#x4E2D;&#x4E8E;&#x63A7;&#x5236;&#x6D41;&#x7A0B;&#x548C;&#x5BF9;&#x5927;&#x7684;&#x7B97;&#x6CD5;&#x8FDB;&#x884C;&#x5206;&#x89E3;&#x3002;&#x8FD9;&#x79CD;&#x89C2;&#x70B9;&#x9664;&#x4E86;&#x5E38;&#x5E38;&#x4EA7;&#x751F;&#x8106;&#x5F31;&#x7684;&#x7CFB;&#x7EDF;&#x4E4B;&#x5916;&#x6CA1;&#x6709;&#x5176;&#x4ED6;&#x672C;&#x8D28;&#x4E0A;&#x7684;&#x5BB3;&#x5904;&#x3002;&#x5F53;&#x9700;&#x6C42;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF08;&#x603B;&#x4F1A;&#x53D8;&#x5316;&#x7684;&#xFF09;&#x4EE5;&#x53CA;&#x7CFB;&#x7EDF;&#x589E;&#x957F;&#xFF08;&#x603B;&#x4F1A;&#x589E;&#x957F;&#xFF09;&#x65F6;&#xFF0C;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5EFA;&#x9020;&#x7684;&#x7CFB;&#x7EDF;&#x5C31;&#x4F1A;&#x53D8;&#x5F97;&#x5F88;&#x96BE;&#x7EF4;&#x62A4;&#x3002;
</p>
</blockquote>
<blockquote>
<p>
&#x73B0;&#x4EE3;&#x7684;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x91C7;&#x7528;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x89C2;&#x70B9;&#x8FDB;&#x884C;&#x5EFA;&#x6A21;&#x3002;&#x6309;&#x7167;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x6240;&#x6709;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x90FD;&#x7528;&#x5BF9;&#x8C61;&#x6216;&#x8005;&#x7C7B;&#x4F5C;&#x4E3A;&#x5176;&#x4E3B;&#x8981;&#x7684;&#x6784;&#x9020;&#x5757;&#x3002;&#x7B80;&#x5355;&#x5730;&#x8BB2;&#xFF0C;&#x5BF9;&#x8C61;&#x901A;&#x5E38;&#x662F;&#x4ECE;&#x95EE;&#x9898;&#x7A7A;&#x95F4;&#x6216;&#x89E3;&#x7A7A;&#x95F4;&#x7684;&#x7684;&#x8BCD;&#x6C47;&#x4E2D;&#x62BD;&#x53D6;&#x51FA;&#x6765;&#x7684;&#x4E1C;&#x897F;&#xFF1B;&#x7C7B;&#x662F;&#x5BF9;&#x5177;&#x6709;&#x5171;&#x540C;&#x6027;&#x8D28;&#x7684;&#x4E00;&#x7EC4;&#x5BF9;&#x8C61;&#xFF08;&#x4ECE;&#x5EFA;&#x6A21;&#x8005;&#x7684;&#x89C6;&#x89D2;&#xFF09;&#x7684;&#x63CF;&#x8FF0;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x90FD;&#x6709;&#x6807;&#x8BC6;&#xFF08;&#x80FD;&#x591F;&#x5BF9;&#x5B83;&#x547D;&#x540D;&#xFF0C;&#x4EE5;&#x533A;&#x522B;&#x4E8E;&#x5176;&#x4ED6;&#x5BF9;&#x8C61;&#xFF09;&#x3001;&#x72B6;&#x6001;&#xFF08;&#x901A;&#x5E38;&#x6709;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#x4E0E;&#x5B83;&#x76F8;&#x8054;&#x7CFB;&#xFF09;&#x548C;&#x884C;&#x4E3A;&#xFF08;&#x80FD;&#x5BF9;&#x8BE5;&#x5BF9;&#x8C61;&#x505A;&#x67D0;&#x4E9B;&#x4E8B;&#xFF0C;&#x5B83;&#x4E5F;&#x80FD;&#x4E3A;&#x5176;&#x4ED6;&#x5BF9;&#x8C61;&#x505A;&#x67D0;&#x4E9B;&#x4E8B;&#xFF09;&#x3002;
</p>
</blockquote>
</div>
</div>
</div>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/UML/" rel="tag"># UML</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2017/12/30/uml-note-of-common-machanism/" rel="next" title="[UML笔记] 公共机制">
                <i class="fa fa-chevron-left"></i> [UML笔记] 公共机制
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2018/01/10/note-introduction-to-uml/" rel="prev" title="[UML笔记]UML介绍">
                [UML笔记]UML介绍 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            Table of Contents
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            Overview
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/avatar.jpg"
               alt="Jack Gao" />
          <p class="site-author-name" itemprop="name">Jack Gao</p>
           
              <p class="site-description motion-element" itemprop="description">Jack Gao's Blog</p>
          
        </div>
        <nav class="site-state motion-element">

          
            <div class="site-state-item site-state-posts">
              <a href="/archives/">
                <span class="site-state-item-count">22</span>
                <span class="site-state-item-name">posts</span>
              </a>
            </div>
          

          
            
            
            <div class="site-state-item site-state-categories">
              <a href="/categories/index.html">
                <span class="site-state-item-count">18</span>
                <span class="site-state-item-name">categories</span>
              </a>
            </div>
          

          
            
            
            <div class="site-state-item site-state-tags">
              <a href="/tags/index.html">
                <span class="site-state-item-count">32</span>
                <span class="site-state-item-name">tags</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

        


      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#org1e21602"><span class="nav-number">1.</span> <span class="nav-text">1 引言</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#org1a5b680"><span class="nav-number">2.</span> <span class="nav-text">2 建模的重要性</span></a><ol class="nav-child"><li class="nav-item nav-level-3"><a class="nav-link" href="#orgd5f4883"><span class="nav-number">2.1.</span> <span class="nav-text">2.1 模型是什么？</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#org9563b05"><span class="nav-number">2.2.</span> <span class="nav-text">2.2 为什么要建模</span></a></li></ol></li><li class="nav-item nav-level-2"><a class="nav-link" href="#orge73b89b"><span class="nav-number">3.</span> <span class="nav-text">3 建模原理</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#orgbc00d50"><span class="nav-number">4.</span> <span class="nav-text">4 面向对象建模</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy;  2017 - 
  <span itemprop="copyrightYear">2018</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Jack Gao</span>
</div>


<div class="powered-by">
  Powered by <a class="theme-link" href="https://hexo.io">Hexo</a>
</div>

<div class="theme-info">
  Theme -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Mist
  </a>
</div>


        

        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
      </div>
    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  












  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.1"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.1"></script><!-- hexo-inject:begin --><!-- Begin: Injected MathJax -->
<script type="text/x-mathjax-config">
  MathJax.Hub.Config({"tex2jax":{"inlineMath":[["$","$"],["\\(","\\)"]],"skipTags":["script","noscript","style","textarea","pre","code"],"processEscapes":true},"TeX":{"equationNumbers":{"autoNumber":"AMS"}}});
</script>

<script type="text/x-mathjax-config">
  MathJax.Hub.Queue(function() {
    var all = MathJax.Hub.getAllJax(), i;
    for(i=0; i < all.length; i += 1) {
      all[i].SourceElement().parentNode.className += ' has-jax';
    }
  });
</script>

<script type="text/javascript" src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML">
</script>
<!-- End: Injected MathJax -->
<!-- hexo-inject:end -->



  


  




	





  





  





  






  





  

  

  

  

  

  

</body>
</html>
